[
    {
        "title": "Levels 1–24: Tutorial & Kharid-et",
        "content": [
            "At these levels you should aim to obtain all of the artefacts needed and complete all the content listed before moving on, even if you have passed the levels required. If you are short of the materials required to restore artefacts purchase them on the Grand Exchange.",
            "Even if you are not looking to complete all Archaeology related content you should follow the recommendations in this section so that you can unlock the assistant qualification. The qualification is required to access the Stormguard Citadel Dig Site at level 70, and the Warforge Dig Site at level 76. Additionally it is needed to send out teams to complete research, which is recommended as a passive way to gain additional experience.",
            "Start out by completing the Archaeology tutorial by speaking to Acting Guildmaster Reiniger at the Archaeology Campus. Upon completion players will have obtained level 5 Archaeology and should progress to the Kharid-et Dig Site.",
            "Go to the Kharid-et Dig Site, talk with Dr Nabanik, and view the cutscene. Afterwards, walk down the slope, uncover the venator remains, and excavate these. They will give damaged venator light crossbows and damaged venator daggers. To make a start on the artefact collections, you should save two light crossbows and two daggers after restoring them and hand them in to Soran and Velucia to contribute to their collection logs.",
            "At level 12 speak to Dr Nabanik again to receive a damaged centurion's seal and begin the Breaking the Seal mystery. Excavate the dirt pile blocking the doorway that leads into the rest of Kharid-et dig site. Restore the centurion's seal and click on the excavated door frame to enter Kharid-et - Barracks excavation site.",
            "Head to the first building on the west side to find the legionary remains and excavate them. To continue with your collection log, you should expect to save two Primis Elementis standards, legionary gladius, and legionary square shields. One damaged gladius can be obtained from the Demon Door research mission once you complete your first Archaeology qualification if you prefer. While you are excavating at the barracks excavation site (recommended for level 12-24 and 25-28) you will randomly receive custodian's log pages. There are a total of four pages to find; once they are discovered you should complete the Prison Break mystery.",
            "This is the first excavation hotspot at the Kharid-et dig site where you can find pylon batteries while excavating. The batteries are used to charge pylons in the main fortress, giving an amount of Archaeology experience dependent on your level and the number of batteries used. When the pylons are fully charged the Protection of Zaros status effect is activated, giving +10% Archaeology experience, +5% mattock precision, an increased chance to obtain tetracompass pieces and complete tomes, and a small chance of finding a piece of the inquisitor staff.",
            "At level 17, move to the castra debris located right in front of the sealed door. Save two restored Zarosian effigies and Zarosian training dummies for Soran and Velucia. Save an additional Zarosian training dummy so that you can unlock Katarina as a researcher for your team once you unlock your research team. Alternatively, a damaged Zarosian training dummy can be obtained from the Demon Door research mission if you prefer."
        ]
    },
    {
        "title": "Levels 24–42: Infernal Source & Assistant Qualification",
        "content": [
            "You will unlock the Infernal Source Dig Site at level 20, but you should stay at Kharid-et until you reach level 24. At level 24, go to the Infernal Source Dig Site. Upon using the lift, you will find yourself in the Star Lodge cellar. You will see a furnace missing three crests of Dagon, which must be replaced to complete the Eyes in Their Stars mystery. Open all of the Star Lodge storage boxes in the area to find one restored crest of Dagon and one damaged crest of Dagon. You will also find the books 'Doctrinas Cupidate' and 'Philisophia in Cubiculo' which can be read to gain 250 experience each. A third crest of Dagon should be found by excavating the lodge art storage hotspots. You need another four crests of Dagon for collections (making seven altogether), and three 'Disorder' paintings.",
            "Once you have acquired the required artefacts from lodge art storage, move to the lodge bar storage hotspots in the southern area. You need three hookah pipes and four opulent wine goblets for collections. An additional restored wine goblet is needed to recruit Dorian to your research team at level 40. One damaged goblet can be obtained from the Starry Eyed research mission if you prefer.",
            "While excavating the lodge art and lodge bar storage you will come across four founder's journal pages; they can only be found at these hotspots. Once you have found them all complete the Eyes in Their Stars mystery using the three crests of Dagon you obtained earlier.",
            "Head back to the Kharid-et - Barracks excavation site and excavate administratum debris hotspots in the room to the south of the entrance. This is the last excavation hotspot where custodian's log pages can be obtained so make sure you have obtained all four of them and completed the Prison Break mystery before moving on. You should now have all the artefacts required to fully complete the Museum - Zarosian I and Zarosian I artefact collections for the first time.",
            "Return to the Infernal Source Dig Site and go to the Dungeon of Disorder area. There are bookshelves here which can be searched to obtain the books 'Amor Dente' and 'Malum Infernale' and a cultist chores rota; each of which can be read to gain 500 experience. Excavate the cultist footlocker spots in the south-east corner. Three greater demon masks, three imp masks, and three lesser demon masks are required to complete collections. One damaged imp mask can be obtained from the Abandon All Hope research mission at level 40.",
            "While excavating these spots you will accumulate four cultist's diary journals. Once you have them all complete the Embrace the Chaos mystery. If you walk further forward after completing the mystery you will be greeted by a gargoyle who will prompt the start of the Contract Claws mystery, which can be completed at this point.",
            "At level 36, move to the sacrificial altar pile in the north-west of the Dungeon of Disorder. You will need two Order of Dis robes and three ritual daggers to complete collections. One ritual dagger can be obtained from The Dark Underbelly research mission. You should be able to fully complete the Museum - Zamorakian I and Zamorakian I artefact collections at this point.",
            "With at least level 40 Archaeology the assistant qualification can be unlocked by talking to Acting Guildmaster Reiniger (doing so will also complete the Secrets of the Monolith mystery). If you have not obtained enough materials to restore each artefact, purchase them from the Grand Exchange. Avoid material caches unless absolutely necessary.",
            "With this qualification unlocked you can purchase the first set of upgrades from the Archaeology Guild Shop: soil box capacity, material storage container capacity, and base mattock precision. You can also claim two material manuals, two hi-spec monocles, two tarpaulin sheets, and two cups of archaeologist's tea from Acting Guildmaster Reiniger.",
            "You can now begin sending out teams to complete research. Recruit Katarina and Dorian to your research team by speaking to them around the Varrock Dig Site. You will need to give them the restored Zarosian training dummy and opulent wine goblet obtained earlier. After this, complete the highest level general research available to you alongside training."
        ]
    },
    {
        "title": "Levels 42–60: Everlight Dig Site",
        "content": [
            "Alongside actively training you should complete the highest level general research available to you as often as you can. This requires spending chronotes, which are tradeable and can be bought from the Grand Exchange.",
            "Even if you are not looking to complete all Archaeology related content you should aim to unlock the associate qualification. This qualification is required to access the Orthen Dig Site at level 90, purchase the Archaeologist's outfit and auto-screener v1.080, and expand the size of your research team.",
            "For the associate qualification you need level 70 Archaeology, 5 completed artefact collections, 250 found and restored artefacts, and 10 mysteries completed. Having completed all level 1-42 content you will have 4 collections and 6 mysteries done. You can prioritise the artefact count requirement by returning to a low level spot such as venator remains. If you wish to complete collections for a better experience rate, the Zarosian I or Museum - Zarosian I collections each give a 4,271.8 experience completion bonus.",
            "At level 42 head to the Everlight Dig Site and go through the cutscene. Excavate the prodromoi remains; you will need two 'frying pans' and two hallowed lanterns to complete collections, as well as an additional 'frying pan' and two hallowed lanterns to complete mysteries. While excavating here (or later at monoceros remains from level 48-50) you will accumulate four queen's journal pages and may find icyene remains. Once you have all the journal pages you can complete the Queen of the Icyene mystery. When the icyene remains are found the Fallen Angels mystery can be completed. With level 40 Construction and 10 white marble the Statue of Hebe can be repaired and a restored hallowed lantern added to it for 785 Archaeology experience.",
            "Return to the Dungeon of Disorder section of the Infernal Source Dig Site at level 45 and excavate the dis dungeon debris hotspot. This is the last hotspot where cultist's diary pages can be obtained, so find all of these and complete the Embrace the Chaos mystery before moving on.",
            "At level 47, go to the Kharid-et Dig Site and enter the Kharid-et - Carcerem excavation site (the prison). You will need to complete the Prison Break mystery to enter. A restored legatus pendant can be added to the tool belt to allow access to more areas in the carcerem excavation site otherwise blocked by the legatus barrier.",
            "Return to the Everlight - Mass grave excavation site at level 48 and excavate the monoceros remains. If you have not already collected the four queen's journal pages and icyene remains, find these and complete the Queen of the Icyene and Fallen Angels mysteries before moving on.",
            "At level 51 switch to the amphitheatre debris excavation hotspots at the Everlight - Amphitheatre excavation site. With level 40 Construction and 10 white marble the Statue of Mesomedes can be repaired. A restored everlight harp can then be added to the statue to gain 1,278 Archaeology experience and a hand of glory.",
            "Move to the ceramics studio debris hotspots at level 56. You should now be able to fully complete the Museum - Saradominist I and Saradominist I artefact collections for the first time.",
            "At level 58, return to the Kharid-et - Carcerem excavation site and pass through the legatus barrier to excavate the carcerem debris. One more 'Incite Fear' spell scroll is required to complete The Vault of Shadows quest. An additional restored pontifex signet ring should be added to the tool belt to allow passage through the pontifex barrier to access further excavation hotspots. You may also wish to create a pontifex observation ring, which uses another pontifex signet ring."
        ]
    },
    {
        "title": "Levels 60–70: Senntisten & Multiple Sites",
        "content": [
            "At level 60 you can access the Senntisten Dig Site and excavate the ministry remains at the Senntisten - Cathedral excavation site. You can obtain the first Inquisitor's Memoirs page from this hotspot, required for the Secrets of the Inquisition mystery; a restored funerary urn of shadow is also needed.",
            "Ancient glass shards are found while excavating throughout the Senntisten Dig Site. These can be used to repair the four broken stained glass windows in the cathedral. To fully repair each window 100 ancient glass shards and level 80 Crafting are required. Repairing all the windows completes the Pane in the Glass achievement.",
            "At level 61, return to the Everlight - Dominion Games stadium excavation site and excavate stadio debris. While excavating here you will be able to find five athlete's journal pages and complete the Fall and Rise mystery. You should now be able to complete the Museum - Zarosian V and Museum - Zarosian VI collections for the first time.",
            "At level 62, go to the Senntisten - Cathedral excavation site and excavate the cathedral debris. You can obtain the second Inquisitor's Memoirs page from this hotspot; a restored funerary urn of smoke is also needed. Pages one and two of A critic's review can only be obtained from cathedral debris, needed later to complete the Night Theatre mystery.",
            "Move to the Senntisten - Marketplace excavation site at level 63 and collect from the marketplace debris. A restored funerary urn of ice is also needed. A critic's review (article 4) (for the Night Theatre mystery) and a warning letter (for the Empty Children mystery) can only be obtained from the marketplace debris. You should also complete the Complete the Pattern, Solve the Puzzle special research.",
            "At level 64 move to the inquisitor remains in the marketplace excavation site. A critic's review (article 3) and pages three and four of the Inquisitor's Memoirs can only be uncovered at this excavation hotspot. You can complete the Finery of the Inquisition collection at this point.",
            "At level 65 go to the Infernal Source - Vestibule of Futility south excavation site and train at the Infernal Source - Vestibule of Futility south-east excavation site.",
            "At level 66, return to the Senntisten - Marketplace excavation site and begin excavating the gladiator remains. At the colosseum gateway use the 'enter (non combat)' option. While here you can obtain the fourth page of the Inquisitor's Memoirs and progress the Secrets of the Inquisition mystery using a restored funerary urn of blood. It is recommended to complete up until the point where the Crossing that Bridge special research is sent out as soon as you can, as this is required to unlock the next excavation site. A scrawled note (for the Empty Children mystery) can only be obtained from this hotspot, after which the mystery can be completed.",
            "Once you have reached level 67 and completed the Crossing that Bridge research you can move to the Senntisten - Bridge excavation site. Excavate the citizen remains there. Pages six and seven of the Inquisitor's Memoirs can only be obtained at this site. The eighth page can only be obtained from the ministry remains hotspot after these have been obtained, so you will have to backtrack at this point to find it. You can then complete the Secrets of the Inquisition mystery. The fifth critic's review article can also only be obtained here; after finding it the Night Theatre mystery can be completed. Four artefact collections can be completed after this site: Museum - Zarosian VII, Entertaining the Masses, Religious Iconography, and Urns of the Empire.",
            "At level 68 go to the Infernal Source - Vestibule of Futility north-east excavation site and excavate the shakroth remains. Before handing in the spiked collars you may want to complete the Who's a Bad Boy? achievement; the collar is not consumed. An additional restored chaos star can be added to your tool belt to prevent portals in the area from misfiring. You can then complete the Dagon Bye mystery. After completing this mystery you should have completed all the Infernal Source site mysteries and will be able to recruit Movario to your research team. The Blingy Fings artefact collection can be fully completed for the first time at this point.",
            "At level 69, return to the Dominion Games stadium excavation site and excavate the dominion games podium hotspots. Obtain three bronze dominion medals, three dominion torches, and three silver dominion medals for collections. Restore the statue of Padosan with level 40 Construction and 10 white marble and add a restored dominion torch to gain 2,470 Archaeology experience. Another dominion torch is required to complete the Hallowed Be... mystery later on. If you have not already, obtain all five athlete's journal pages and complete the Fall and Rise mystery.",
            "With at least level 70 Archaeology the associate qualification can be unlocked by talking to Acting Guildmaster Reiniger. You are not likely to have restored enough artefacts at this point; return to venator remains or complete Zarosian I collections to meet the requirement.",
            "With the associate qualification unlocked you can purchase the next set of upgrades from the Archaeology Guild Shop: soil box capacity, material storage capacity, and base mattock precision. You can also purchase the archaeologist's outfit (5% increased experience when worn as a full set). You may wish to purchase the blueprints for the auto-screener v1.080, which requires level 67 Invention to manufacture. The auto-screener automatically converts soil into materials but does not yield damaged artefacts or Archaeology experience.",
            "After completing the qualification, three material manuals, three hi-spec monocles, three tarpaulin sheets, and three cups of archaeologist's tea may be claimed from Acting Guildmaster Reiniger. You can now also recruit Alpheus and Eliza to your research team; they are located on Anachronia and will ask to join your team if you show them a completed totem. You can complete the Mysterious Monolith: Architecture special research."
        ]
    },
    {
        "title": "Levels 70–83: Stormguard Citadel & Daemonheim",
        "content": [
            "You may or may not wish to eventually unlock the professor qualification (level 90) and the guildmaster qualification (level 99) depending on your training goals. Both expand your research team and allow further upgrades from the Archaeology Guild Shop. The guildmaster qualification allows the master archaeologist's outfit and an energised meteorite shard (required to create the mattock of time and space) to be purchased. If you are aiming to train to level 120 or beyond it is recommended to obtain all qualifications.",
            "If you were aiming to reach the associate qualification only, you can now move to completing artefact collections for fast experience rates. Continue completing the Zarosian I or Museum - Zarosian I collections until level 76. At level 76 you can enter the Warforge Dig Site and excavate the gladiatorial goblin remains. At level 83 complete the Out of the Crucible mystery so that you can also excavate the goblin dorm debris. With both sites available you can repeatedly complete the Green Gobbo Goodies I artefact collection for 34,533.5 experience per completion.",
            "At level 89 you can start excavating the Big High War God shrine hotspots to work towards completing Green Gobbo Goodies II collections. With all required sites available you can repeatedly complete the Green Gobbo Goodies II artefact collection for 60,666.6 experience per completion. If you find all four pieces of imcando metal while at the Warforge dig site you may wish to complete the Into the Forge mystery so that you can smith an imcando mattock.",
            "At level 70 you will be invited to go to the Stormguard Citadel Dig Site. Head to the Temple of Ikov and study the northern or southern archway to uncover the Ikovian Tragedy special research. Send off your research team and start excavating the Ikovian memorial hotspots. Once you have obtained and restored an Ikovian gerege, either from the hotspots or from completing the special research, add it to your tool belt.",
            "Enter the citadel and continue excavating the Ikovian memorials. While excavating inside the citadel there is a chance you will find the boots of flight. When you find them you can add them to your tool belt and complete the Leap of Faith mystery. The exile's vow can only be found while excavating Ikovian memorial hotspots; when found, talk to Gee'ka to complete the Atonement mystery. You can now complete the Museum - Saradominist II and Saradominist II collections for the first time.",
            "While excavating at hotspots within the Stormguard Citadel you can find torn blueprint fragments which are used to create blueprints for Ancient Invention; this cannot be unlocked until you reach level 95 Archaeology.",
            "At level 72, return to the Everlight - Oikoi excavation site and excavate the oikos studio debris piles. You may find a psiloi buckler while excavating here; this and a restored kantharos cup should be kept to complete The Everlight mystery later on. The four pages of Archon's journal may be found here, or at level 84 at the oikos fishing hut remnants. If you get them all complete The Dour of Bable mystery.",
            "At level 73 you will be able to use the Daemonheim Dig Site for the first time. You will need to have freed Skaldrun while completing frozen floors during Dungeoneering. Head to the Daemonheim - Castle excavation site and excavate the castle hall rubble. Obtain Balarak's and Tokshak's rings, which can only be obtained at the castle hall rubble hotspots, and complete the A New Home mystery.",
            "At level 74, excavate the Kharid-et chapel debris. You may start to find the three pages of the pater's log here; they may also be found at later excavation hotspots. When you have found them all complete The Cult of Orcus mystery.",
            "First return to the Stormguard Citadel Dig Site at level 76. If you have not already obtained the Boots of Flight from the Ikovian memorial hotspot, excavate this now as they become a guaranteed drop at level 76. When you have the boots find the damaged wingsuit v1, restore it, and add it to your tool belt. Find two lightning conductors to upgrade to the wingsuit v2 and then two gravitron repulsors to upgrade to the wingsuit v3. Complete the Wing Out mystery once you have fully upgraded the wingsuit. Excavate the keshik ger hotspots at the Stormguard Citadel - Keshik memorial excavation site. You may start to find the three mission reports required to complete The Spy Who Loved Metal mystery.",
            "Once you have completed Wing Out and restored the required artefacts, swap to the Warforge Dig Site. Maximising time at Warforge is recommended as you will obtain the pieces required to forge the imcando mattock here. Talk to Zanik at the Warforge to view the introductory cutscene. Excavate the gladiatorial goblin remains at the Warforge - Crucible arena excavation site. You may start to find some of the five pages for The First Commander mystery here.",
            "At level 77, return to the Daemonheim - Castle excavation site and excavate the tunnelling equipment repository. Find Halak's ring for the A New Home mystery; it can only be found at this hotspot. You can now complete Dragonkin V and Museum - Dragonkin V for the first time.",
            "At level 78 move to the botanical reserves on the 1st floor of the Daemonheim dig site. Find Yorga's pipe for the A New Home mystery; it can only be found at this site. If you have not already found all four pieces for the imcando mattock then return to the gladiatorial goblin remains after finding the pipe and the artefacts needed from the botanical reserves.",
            "There are four different excavation hotspots available at level 81, so you will hop between them until you have the required artefacts from each. At the Infernal Source - Vestibule of Futility south-east excavation site excavate the animal trophies and complete the Zamorakian II and Museum - Zamorakian II collections. At the Stormguard Citadel - Relay station excavation site excavate the tailory debris; if you have not completed The Spy Who Loved Metal, obtain the three required mission reports here as this is the last hotspot where they will be obtained. An aviansie dreamcoat can be given to Armadyl to obtain the ring of Solomon, used to unlock the Death Ward relic power. Complete the Armadylean I and Museum - Armadylean I collections. At the Kharid-et - Chapel excavation site excavate the pontifex remains and complete the Zarosian II, Museum - Zarosian II, and Smoky Fings collections. Finally, return to the Warforge Dig Site and excavate crucible stands debris until you reach level 83 to maximise your chances of finding all pieces of the imcando mattock."
        ]
    },
    {
        "title": "Levels 83–90: Warforge & Professor Qualification",
        "content": [
            "At level 83 excavate the barricade in the Warforge Dig Site; fully removing it completes the Out of the Crucible mystery and allows access to the Warforge - South goblin tunnels excavation site. Enter the area and investigate the doors to Thalmund's Forge to begin the Into the Forge mystery. Complete the mystery by finding 11 keys throughout the area; this requires 35 Dungeoneering and 28 Fishing. After completing the mystery you can access the forge and create an imcando mattock once you have found all four imcando metal pieces.",
            "Excavate the goblin dorm debris. You can complete your first Green Gobbo Goodies I collection by handing in artefacts to General Wartface.",
            "At level 84, go to the Everlight - Oikoi excavation site and excavate the Oikos fishing hut remnants. If you have not already completed The Dour of Bable mystery make sure you have obtained the four pages of Archon's journal and complete it now, as this is the last excavation hotspot they can be obtained from.",
            "At level 85, at the Stormguard Citadel - Research & Development north-west excavation site excavate the weapons research debris. Restore two hawkeye lens multi-vision scopes and two talon-3 razor wings for collections. You may start to find project pages required for the A Study in Aether mystery here and at later hotspots. If you have level 70 Divination you may wish to activate the nearby stormguard portal using 20 unnoted quintessence for easy access.",
            "At level 86, go to the Kharid-et - Chapel excavation site and excavate the orcus altars. Obtain an additional restored spell scroll if you want to complete The Vault of Shadows, as one is consumed during the quest. A restored necromantic focus is also required for the Tomes of the Warlock quest. This is the final hotspot where the three pater's log pages can be found, so obtain these and complete The Cult of Orcus mystery if you have not already done so.",
            "At level 87, return to the Daemonheim - Castle excavation site and excavate the communal space spots on the 1st floor. Add a restored 'friendship bracelet' to your tool belt to allow access to the Daemonheim - Depths excavation site. Find the tarnished plaque, which can only be found at the communal space hotspots, and complete the A New Home mystery. You can complete the Dragonkin VI and Museum - Dragonkin VI collections after this site.",
            "At level 89, excavate dis overspill at the Infernal Source - The Harrowing south-east excavation site. Once you have the required artefacts, go to the Warforge - North goblin tunnels and excavate from the Big High War God shrine hotspots. You may find the Forge War! page here and hand it in to complete the Forge War! mystery. The Museum - Bandosian I, Hitty Fings, and Anarchic Abstraction collections can be completed at this point.",
            "With at least level 90 Archaeology the professor qualification can be unlocked by talking to Acting Guildmaster Reiniger. If you have completed all artefact collections and mysteries up to this point you will have completed 32/20 unique collections and 22/15 mysteries required. You are not likely to have restored enough artefacts straight away; completing Green Gobbo Goodies I or II is recommended to meet this requirement.",
            "When you have unlocked the professor qualification you can complete the Mysterious Monolith: Symbology special research and automatically unlock Drew, Helen, and Easty for your research team. You can now purchase another set of upgrades from the Archaeology Guild Shop: soil box capacity, material storage capacity, base mattock precision, and an additional relic loadout slot if you wish. Four material manuals, four hi-spec monocles, four tarpaulin sheets, and four cups of archaeologist's tea may be claimed from Acting Guildmaster Reiniger."
        ]
    },
    {
        "title": "Levels 90–99: Orthen Dig Site",
        "content": [
            "For fast experience you can continue to repeatedly complete the Green Gobbo Goodies II collection for 60,666.6 experience per completion. All three artefacts from the Big High War God shrine are required, plus an idithuun horn ring from the yu'biusk animal pen hotspot at level 94, and a garagorshuun anchor from the goblin trainee remains hotspot at level 97. A completed tome from a full tetracompass gives at least 41,290 experience at level 97.",
            "You can now access the Orthen Dig Site on Anachronia for the first time. Upon arriving speak to Mr Mordaut to view a cutscene; activate the inactive teleport device east of the base camp lodestone; then head to the Orthen - Crypt of Varanus excavation site. Activate the Orthen teleportation device outside the crypt to unlock the Incomplete Portal Network I special research and progress the Teleport Node On mystery, then enter the site and excavate the varanusaur remains. Study the funeral pyre in the centre to unlock the Breath of Fire special research mission. While excavating here you may find the four pages required to complete Crypt o' Zoology.",
            "The Orthen Dig Site has a mechanic similar to the pylon at the Al-Kharid dig site. While excavating you can find rex skeleton fragments which can be used to restore the rex skeleton at Anachronia base camp. When the skeleton has been fully completed across all game worlds the Roar of Osseous buff is activated, giving 25% increased experience and a 10% increased chance to receive materials for 65 minutes.",
            "With level 90 Archaeology and completion of Desperate Measures you can excavate the orthen rubble and dragonkin remains at the Orthen - Nodon hibernatorium excavation site until you have found the ceremonial dragonkin device and ceremonial dragonkin tablet. Restore them and hand them in to Giles to complete the Desperate for Artefacts collection, which awards a cosmic pyramid. The pyramid can be combined with the cosmic focus to create the cosmic accumulator.",
            "At level 91, move back to the Stormguard Citadel - Research & Development north-west excavation site and excavate the gravitron research debris. Complete the Wise Am the Music Man collection by handing in artefacts to the Wise Old Man. Experience rates average around 117,000 experience an hour at these spots with good equipment.",
            "At level 92, return to the Everlight - Acropolis excavation site and excavate the acropolis debris. You can now complete the Showy Fings collection with Chief Tess for the first time. One restored rod can be added to the repaired Statue of Tromple (10 white marble, level 40 Construction) to receive the 'Tromple's Troubling Tales' experience book granting 50,000 Archaeology experience. At this site you may start to find the five excerpts of the Epic of Hebe, required to complete The Epic of Hebe mystery.",
            "At level 93, go to the Kharid-et - Culinarum excavation site and get two Zarosian ewers and Zarosian steins from the armarium debris. Experience rates average around 120,000-130,000 experience an hour at these spots.",
            "At level 94, excavate the Yu'biusk animal pen hotspots at the Warforge - Animal pens excavation site. You can hand in the Red Rum Relics I collection to General Bentnoze for the first time. Experience rates average around 125,000 experience an hour at these spots.",
            "At level 95, return to the Stormguard Citadel - Dayguard tower excavation site and excavate Keshik tower debris. Once you have restored one stormguard gerege you can add it to your tool belt and complete the Howl's Floating Workshop mystery and the Back to the Drawing Board special research. This unlocks access to Ancient Invention and the ability to create blueprints using torn blueprint fragments collected up to this point. Experience rates average around 143,000-150,000 experience an hour at this remote site; use signs of the porter or magic notepaper.",
            "At level 96, return to the Orthen - Crypt of Varanus excavation site and train at the dragonkin reliquary excavation hotspots. You may find more pages for the Crypt o' Zoology mystery here and can also obtain fragments for the Archaeology potion recipe.",
            "At level 97, go back to the Warforge - North goblin tunnels and excavate the goblin trainee remains. One of the Ourg megahitters is required to recruit Asgarnia Smith to your research team later on. You can complete the Green Gobbo Goodies II collection with General Wartface for the first time. Experience rates average around 152,000 experience an hour.",
            "At level 98, go to the Infernal Source - The Harrowing north-west excavation site and excavate Byzroth remains. After obtaining all required artefacts from the Infernal Source switch to the Stormguard Citadel - Research & Development south-west excavation site and excavate the destroyed golem excavation hotspots. One restored set of golem instructions is required to recruit Elissa Giovanni to your research team later on. Complete the Museum - Armadylean II and Armadylean II artefact collections. Experience rates average around 172,000 experience an hour.",
            "With at least level 99 Archaeology the guildmaster qualification can be unlocked by talking to Acting Guildmaster Reiniger. You are not likely to have restored enough artefacts at this point; completing Green Gobbo Goodies II is recommended. When you have unlocked the guildmaster qualification you can complete the Philosophy and the Writings of the Walls special research for each dig site. Simon Templeton is automatically unlocked for your research team and Anna Jones, Asgarnia Smith, and Elissa Giovanni can be recruited. You can now purchase the final base mattock precision upgrade, the master archaeologist's outfit, and the energised meteorite shard used to create the mattock of Time and Space from the Archaeology Guild Shop."
        ]
    },
    {
        "title": "Levels 99–110: Late Game Mastery",
        "content": [
            "If you are looking for the fastest experience rates you can continue to repeatedly complete the Green Gobbo Goodies II collection for 60,666.6 experience per completion.",
            "At level 100 you can switch to completing the Saradominist III collection. This requires both artefacts from each of the Oikos fishing hut remnants, acropolis debris, and icyene weapon rack excavation hotspots. Handing in a complete collection gives 77,778 experience and a tetracompass piece. The completed tome obtained from each tetracompass assembled gives at least 46,704 experience at level 100.",
            "From level 102 the Dragonkin II collection can be completed. The collection includes only four artefacts from the autopsy table and experiment workbench hotspots. Each completion awards 81,666.6 experience and 75 rex skeleton fragments. Repeating this collection is effective up to around level 110.",
            "From level 115-119 you may wish to remain at the Bandos's sanctum debris hotspots. At level 119 you can then switch to makeshift pie ovens to obtain 'Da Boss Man' sculptures and complete the Red Rum Relics III collection. The collection gives 159,999.9 experience and a tetracompass piece per completion.",
            "Go to the Orthen - Crypt of Varanus excavation site at level 99 and excavate the dragonkin coffins. You should now have all artefacts required to complete the Museum - Dragonkin I and Dragonkin I artefact collections. If you have not already completed Crypt o' Zoology, obtain all four required pages before moving on as this is the last spot where they can be obtained.",
            "At level 100 return to the Warforge and study Bandos's throne to unlock the Power Behind the Throne special research. Complete the research and excavate the kyzaj champion's boudoir hotspots. Complete the You Have Chosen... mystery using one restored spear and one restored sculpture. The Museum - Bandosian II collection can be completed for the first time by speaking to Velucia. After completing everything at the Warforge, head to the Everlight - Dominion Games stadium excavation site and excavate from the icyene weapon racks, completing the Museum - Saradominist III and Saradominist III collections. Finally, go to the Kharid-et - Culinarum excavation site's culinarum debris hotspots. Experience rates average around 183,000 experience an hour using a mattock of Time and Space with all upgrades and the full master archaeologist's outfit.",
            "At level 101, head to the Orthen - Observation outpost excavation site and excavate the autopsy tables. Complete the Incomplete Portal Network I special research and repair the orthen teleportation device at the outpost. This requires level 70 Runecrafting and 20 un-noted ancient vis. These hotspots may give pieces of the Summoning renewal recipe.",
            "At level 102 move to the experiment workbenches. The workbench hotspots may drop fragments of the holy aggroverload recipe. Complete the Death Watch mystery by finding the four pages from the two types of site in the outpost excavation site. You can also complete the Dragonkin II and Museum - Dragonkin II collections for the first time.",
            "At level 103, return to the Stormguard Citadel - Nightguard tower excavation site and excavate the keshik weapon racks. After obtaining the required artefacts, players with level 95 Dungeoneering can go to the Daemonheim - Castle excavation site, unlock and complete the On the Threshold of the Mind special research, then enter the Daemonheim - Depths excavation site and excavate the projection spaces. You may uncover a strange token here, allowing completion of the A New Age mystery.",
            "At level 104, at the Warforge - North goblin tunnels site excavate from the Warforge scrap piles. Then go to the Infernal Source - The Harrowing north-east excavation site and excavate the hellfire forges hotspots. Complete the Zamorakian III and Museum - Zamorakian III collections for the first time. Experience rates at this level are around 210,000 experience an hour.",
            "At level 105, excavate the stockpiled art hotspots at the Everlight - Underwater cave excavation site. You will need to progress the Hallowed Be... mystery up until you access the underwater cave. While excavating here you will commonly obtain mosaic pieces; when you have 300 you can complete the Hallowed Be... mystery. A restored 'Hallowed Be the Everlight' painting is also required but is not consumed. You can complete the Radiant Renaissance artefact collection. With level 105 Archaeology you can create a lit hallowed lantern and use it on the repaired Statue of Hebe to receive the 'The Epic of Hebe' reward book, granting 50,000 Archaeology experience.",
            "At level 106, complete the Incomplete Portal Network II special research and the Know Thy Measure mystery to unlock access to the Moksha ritual site. Repair the Orthen teleportation device outside the ritual site using 20 un-noted orthenglass. Enter the Orthen - Moksha ritual site excavation site and excavate the aughra remains. While excavating here you may find the four pages required to complete the Free Your Mind mystery.",
            "At level 107, return to the Daemonheim - Depths excavation site and excavate the security booths. Get the chunk of primal alloy before moving on as it can only be obtained here and is required to complete A New Form. Then move to the Kharid-et - Praetorium excavation site and excavate ancient magick munitions hotspots. One of the spell scrolls is required for The Vault of Shadows quest. You can start to find the six pages from the commander's log (for Decimation mystery) and five pages from the Praetorian's log (for Shadow Fall mystery) here. You will also have all restored artefacts required to complete the Museum - Zarosian III, Zarosian III, and Imperial Sorcery collections.",
            "At level 108, return to the Orthen - Moksha ritual site and excavate moksha devices. Complete the Fragmented Memories mystery using a restored lingam stone and master control to gain access to Xolo City. You can also complete the Dragonkin III and Museum - Dragonkin III artefact collections.",
            "At level 109, go to the bibliotheke debris at the Everlight - Acropolis excavation site."
        ]
    },
    {
        "title": "Levels 110–120+: Endgame",
        "content": [
            "At level 110, first go to the Infernal Source - Dagon Overlook north excavation site and excavate the chthonian trophies. For the rest of the level go to the Warforge weapon racks at the Warforge - Thalmund's forge excavation site. Complete the Red Rum Relics II collection for the first time by handing in artefacts to General Bentnoze. You may find the five pages required to complete the Heart of the Forge mystery at this spot.",
            "At level 111, go to the Stormguard Citadel - Research & Development south-east excavation site and excavate from the flight research debris.",
            "At level 112, move to the Stormguard Citadel - Howl's workshop excavation site and excavate from the aetherium forges. A damaged prototype godsword is used in the That's Not How it Works achievement but is not consumed.",
            "At level 113 you will start training at the Orthen - Xolo city excavation site for the first time. You will need to complete the Fragmented Memories mystery to enter. Complete the Incomplete Portal Network III special research and restore the Orthen teleportation device outside Xolo City using 20 un-noted quintessence. You should now have restored all teleportation devices, completing the Teleport Node On mystery. At Xolo City excavate from the xolo mines. You can start to find the four pages required to complete the I Am Become Death mystery at this site, as well as fragments of the powerburst of opportunity recipe.",
            "After this, complete the Thought Process special research to unlock the Daemonheim - Depths excavation site and train at the traveller's stations. Complete the Dragonkin VII and Museum - Dragonkin VII artefact collections. The cracked totem and mangled trinket required to complete A New Form mystery can only be excavated from this hotspot, after obtaining them the mystery can be completed. These are the final hotspots where the strange token can be found so obtain it and complete the A New Age mystery before moving on.",
            "At level 114, return to the Kharid-et - Praetorium excavation site and excavate the praetorian remains. One of the staves is required if creating your own inquisitor staff. Pages for the commander's log and praetorian's log can be obtained here. You can complete the Hat Problem collection by handing in artefacts to the Wise Old Man.",
            "At level 115, go to the Bandos's sanctum debris excavation spots at the Warforge - Bandos's sanctum excavation site.",
            "At level 116, go to the Infernal Source - Dagon Overlook south-west excavation site and excavate Tsutsaroth remains. You can now complete the Zamorakian IV, Museum - Zamorakian IV, and Hat Hoarder collections.",
            "At level 117, train at the optimatoi remains in the Everlight - Underwater cave excavation site. The Saradominist IV and Museum - Saradominist IV collections can be completed for the first time.",
            "At level 118, return to the Stormguard Citadel - Howl's workshop excavation site and train at Howl's workshop debris. The Armadylean III, Museum - Armadylean III, and Magic Man collections can be completed. After obtaining the artefacts from the workshop debris switch to war table debris at the Kharid-et - Praetorium excavation site. Complete the Zarosian IV, Museum - Zarosian IV, and Imperial Impressionism collections. This is the last hotspot where the six commander's log and five praetorian's log pages can be obtained, so get them and complete the Decimation and Shadow Fall mysteries if you have not already done so.",
            "At level 119, start by going to the Orthen - Xolo city excavation site and obtaining the required artefacts from the Xolo remains. Next go to the makeshift pie oven hotspots in the Warforge - Thalmund's forge excavation site. You can complete the Museum - Bandosian III, Green Gobbo Goodies III, Red Rum Relics III, and Knowledge is Power collections.",
            "At level 120+, continue training at the Orthen - Xolo city excavation site. The saurthen debris is the highest level excavation site available. One of each artefact is required to complete the Mysterious City mystery. The final two artefact collections, Dragonkin IV and Museum - Dragonkin IV, can be completed by handing in artefacts to Sharrigan and Velucia. If you have not already completed I Am Become Death, the four pages required to solve the mystery can be obtained here."
        ]
    }
]
