[
    {
        "levels": "1-5",
        "method": "Start out by completing the Archaeology tutorial by speaking to Acting Guildmaster Reiniger at the Archaeology Campus . Upon completion players will have obtained level 5 Archaeology and should progress to the Kharid-et Dig Site ."
    },
    {
        "levels": "5-12",
        "method": "Go to the Kharid-et Dig Site, talk with Dr Nabanik , and view the cutscene. Afterwards, walk down the slope, uncover the venator remains , and excavate these. They will give damaged venator light crossbows and damaged venator dagger . To make a start on the artefact collections, you should save two light crossbows and two daggers after restoring them and hand them in to Soran and Velucia to contribute to their collection logs. Artefacts from Venator remains Artefact Restore XP Needed From research Collections Other uses Venator dagger 305.1 2 N/A Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) N/A Venator light crossbow 305.1 2 N/A Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) N/A"
    },
    {
        "levels": "12-17",
        "method": "At level 12 speak to Dr Nabanik again to receive a damaged centurion's seal and begin the Breaking the Seal mystery. Excavate the dirt pile blocking the doorway that leads into the rest of Kharid-et dig site. Restore the centurion's seal and click on the excavated door frame to enter Kharid-et - Barracks excavation site . Head to the first building on the west side, to find the legionary remains and excavate them. To continue with your collection log, you should expect to save two Primis Elementis standards , legionary gladius , and legionary square shields . One damaged gladius can be obtained from the Demon Door research mission once you complete your first Archaeology qualification if you prefer. While you are excavating at the barracks excavation site (recommended for level 12-24 and 25-28) you will randomly receive custodian's log pages. There are a total of four pages to find; once they are discovered you should complete the Prison Break mystery. This is the first excavation hotspot at the Kharid-et dig site where you can find pylon batteries while excavating. The batteries are used to charge pylons in the main fortress, which gives an amount of Archaeology experience which is dependent on your level and the number of batteries used. When the pylons are fully charged, by players contributing batteries across all game worlds, the Protection of Zaros status effect is activated. This gives +10% Archaeology experience, +5% mattock precision, an increased chance to obtain tetracompass pieces and complete tomes, and a small chance of finding a piece of the inquisitor staff . Artefacts from Legionary remains Artefact Restore XP Needed From research Collections Other uses Primis Elementis standard 430.8 2 N/A Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) N/A Legionary gladius 430.8 2 Demon Door Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) N/A Legionary square shield 430.8 2 N/A Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) N/A"
    },
    {
        "levels": "17-24",
        "method": "At level 17, move to the castra debris located right in front of the sealed door. Save two restored Zarosian effigies and Zarosian training dummies for Soran and Velucia. Save an additional Zarosian training dummy so that you can unlock Katarina as a researcher for your team once you unlock your research team. Alternatively, a damaged Zarosian training dummy can be obtained from the Demon Door research mission if you prefer, once you unlock the team. Artefacts from Castra debris Artefact Restore XP Needed From research Collections Other uses Zaros effigy 520.5 2 N/A Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) N/A Zarosian training dummy 520.5 3 Proving Grounds Museum - Zarosian I ( Velucia ) Zarosian I ( Soran, Emissary of Zaros ) Katarina"
    },
    {
        "levels": "24-25",
        "method": "You will unlock the Infernal Source Dig Site at level 20, but you should stay at Kharid-et until you reach level 24. At level 24, go to the Infernal Source Dig Site. Upon using the lift, you will find yourself in the Star Lodge cellar . You will see a furnace missing three crests of Dagon , which must be replaced to complete the Eyes in Their Stars mystery. Three crests of Dagon are needed to complete the mystery. Open all of the Star Lodge storage boxes in the area to find one restored crest of Dagon and one damaged crest of Dagon . You will also find the books 'Doctrinas Cupidate' and 'Philisophia in Cubiculo' which can be read to gain 250 experience each and some materials. A third crest of Dagon should be found by excavating the lodge art storage hotspots. You need another four crests of Dagon for collections (making seven all together), and three 'Disorder' paintings. Artefacts from Lodge art storage Artefact Restore XP Needed From research Collections Other uses Crest of Dagon 646.2 7 N/A Museum - Zamorakian I ( Velucia ) Showy Fings ( Chief Tess ) Knowledge is Power ( Wise Old Man ) Zamorakian I ( Isaura ) Eyes in Their Stars (3 needed) 'Disorder' painting 646.2 3 N/A Anarchic Abstraction ( Art Critic Jacques ) Museum - Zamorakian I ( Velucia ) Zamorakian I ( Isaura ) N/A Once you have acquired the required artefacts from lodge art storage, move to the lodge bar storage hotspots in the southern area. You need three hookah pipes and four opulent wine goblets for collections. An additional restored wine goblet is needed to recruit Dorian to your research team at level 40. One damaged goblet can be obtained from the Starry Eyed research mission if you prefer. While excavating the lodge art and lodge bar storage you will come across four founder's journal pages ; they can only be found at these hotspots. Once you have found them all complete the Eyes in Their Stars mystery using the three crests of Dagon you obtained earlier. Artefacts from Lodge bar storage Artefact Restore XP Needed From research Collections Other uses Hookah pipe 574.4 3 N/A Museum - Zamorakian I ( Velucia ) Smoky Fings ( Chief Tess ) Zamorakian I ( Isaura ) N/A Opulent wine goblet 574.4 4 Starry Eyed Museum - Zamorakian I ( Velucia ) Smoky Fings ( Chief Tess ) Zamorakian I ( Isaura ) Dorian"
    },
    {
        "levels": "25-29",
        "method": "Head back to the Kharid-et - Barracks excavation site in the main fortress of Kharid-et Dig Site and excavate administratum debris hotspots in the room to the south of the entrance. This is the last excavation hotspots where custodian's log pages can be obtained so make sure you have obtained all four of them and completed the Prison Break mystery before moving on. You should now have all the artefacts required to fully complete the Museum - Zarosian I and Zarosian I artefact collections for the first time. Artefacts from Administratum debris Artefact Restore XP Needed From research Collections Other uses Legatus Maximus figurine 664.1 4 N/A Museum - Zarosian I ( Velucia ) Showy Fings ( Chief Tess ) Magic Man ( Wise Old Man ) Zarosian I ( Soran, Emissary of Zaros ) N/A 'Solem in Umbra' painting 664.1 3 N/A Museum - Zarosian I ( Velucia ) Imperial Impressionism ( Art Critic Jacques ) Zarosian I ( Soran, Emissary of Zaros ) N/A"
    },
    {
        "levels": "29–36",
        "method": "Return to the Infernal Source Dig Site and go to the Dungeon of Disorder area. There are bookshelves here which can be searched to obtain the books 'Amor Dente' and 'Malum Infernale' and a cultist chores rota ; each of which can be read to gain 500 experience. Excavate the cultist footlocker spots in the south-east corner. Three greater demon masks , three imp masks , and three lesser demon masks are required to complete collections. One damaged imp mask can be obtained from the Abandon All Hope research mission at level 40. While excavating these spots you will accumulate four cultist's diary journal. Once you have them all complete the Embrace the Chaos mystery. If you walk further forward after completing the Embrace the Chaos mystery you will be greeted by a gargoyle who will prompt the start of the Contract Claws mystery. Contract Claws can be completed at this point. Artefacts from Cultist footlocker Artefact Restore XP Needed From research Collections Other uses Imp mask 735.9 3 Abandon All Hope Museum - Zamorakian I ( Velucia ) Hat Problem ( Wise Old Man ) Zamorakian I ( Isaura ) N/A Lesser demon mask 735.9 3 N/A Museum - Zamorakian I ( Velucia ) Hat Hoarder ( Wise Old Man ) Zamorakian I ( Isaura ) N/A Greater demon mask 735.9 3 N/A Museum - Zamorakian I ( Velucia ) Hat Hoarder ( Wise Old Man ) Zamorakian I ( Isaura ) How Do You Do, Fellow Demon (not consumed)"
    },
    {
        "levels": "36-42",
        "method": "At level 36, move to the sacrificial altar pile in the north-west of the Dungeon of Disorder. You will need two Order of Dis robes and three ritual daggers to complete collections. One ritual dagger can be obtained from The Dark Underbelly research mission. You should be able to  fully complete the Museum - Zamorakian I and Zamorakian I artefact collections at this point. Artefacts from Sacrificial altar Artefact Restore XP Needed From research Collections Other uses Order of Dis robes 861.5 2 N/A Museum - Zamorakian I ( Velucia ) Zamorakian I ( Isaura ) N/A Ritual dagger 861.5 3 The Dark Underbelly Museum - Zamorakian I ( Velucia ) Magic Man ( Wise Old Man ) Zamorakian I ( Isaura ) I Made Dis (not consumed) With at least level 40 Archaeology the assistant qualification can be unlocked by meeting the achievements listed below and talking to Acting Guildmaster Reiniger (doing so will also complete the Secrets of the Monolith mystery): Qualification - Intern ( 5) – Complete the Archaeology tutorial. Archaeology 40 ( 5) – Reach level 40 in the Archaeology skill. Mystery Solver I ( 5) – Solve 1 of Gielinor's greatest mysteries. Collectors Assemble I ( 5) – Complete 1 unique collection for an archaeological collector. (X/1) The Discoverer IV ( 10) – Excavate damaged artefacts. (X/25) The Restorer IV ( 10) – Restore damaged artefacts. (X/25) If you have completed all the content available up to this point you should have meet all the requirements to complete the qualification. If you have not obtained enough materials to restore each artefact that you've discovered at this point, you should purchase materials from Grand Exchange . Avoid material caches unless absolutely necessary. With this qualification unlocked you can purchase the first set of upgrades from the Archaeology Guild Shop . You should purchase the upgrades to the soil box 's capacity, material storage containers ' capacity, and base mattock precision. You can also claim two material manuals , two hi-spec monocles , two tarpaulin sheets , and two cups of archaeologist's tea from Acting Guildmaster Reiniger. You can now also begin sending out teams to complete research . Recruit Katarina and Dorian to your research team by speaking to them around the Varrock Dig Site . You will need to give them the restored Zarosian training dummy and opulent wine goblet which you obtained earlier. You should complete the following special research, which is available at level 40: Mysterious Monolith: Existence Starry Eyed The Dark Underbelly Abandon All Hope Demon Door Proving Grounds After this complete the highest level general research available to you alongside training."
    },
    {
        "levels": "42-45",
        "method": "At level 42 head to the Everlight Dig Site and go through the cutscene. Excavate the prodromoi remains ; you will need two 'frying pans' and two hallowed lanterns to complete collections, as well as an additional 'frying pan' and two hallowed lanterns to complete mysteries. One damaged hallowed lantern can be obtained from the Lions and Unicorns and Centaurs, Oh My! special research mission at level 42 Archaeology. While excavating here (or later at monoceros remains from level 48-50) you will accumulate four queen's journal pages and may find icyene remains . Once you have all the journal pages you can complete the Queen of the Icyene mystery. When the icyene remains are found the Fallen Angels mystery can be completed. With level 40 Construction and 10 white marble (unnoted) the Statue of Hebe can be repaired. A restored hallowed lantern can then be added to the statue to gain 785 Archaeology experience and some materials . Artefacts from Prodromoi remains Artefact Restore XP Needed From research Collections Other uses 'Frying pan' 1,073.3 3 N/A Museum - Saradominist I ( Velucia ) Saradominist I ( Sir Atcha ) Fallen Angels Hallowed lantern 1,073.3 4 Lions and Unicorns and Centaurs, Oh My! Museum - Saradominist I ( Velucia ) Saradominist I ( Sir Atcha ) Statue of Hebe 'The Epic of Hebe'"
    },
    {
        "levels": "45-47",
        "method": "Return to the Dungeon of Disorder section of the Infernal Source Dig Site and excavate the dis dungeon debris hotspot. This is the last hotspot where the cultist's diary pages can be obtained, so find all of these and complete the Embrace the Chaos mystery before moving on. Artefacts from Dis dungeon debris Artefact Restore XP Needed From research Collections Other uses Branding iron 1,283.3 2 N/A Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) N/A Manacles 1,283.3 2 N/A Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) N/A"
    },
    {
        "levels": "47-48",
        "method": "Go to the Kharid-et Dig Site and enter the Kharid-et - Carcerem excavation site (the prison). You will need to complete the Prison Break mystery to enter this area if you have not already done so. A restored legatus pendant can be added to the tool belt to allow access to more areas in the carcerem excavation site which are otherwise blocked by the legatus barrier . Artefacts from Praesidio remains Artefact Restore XP Needed From research Collections Other uses Ancient timepiece 1,423.3 5 N/A Museum - Zarosian II ( Velucia ) Blingy Fings ( Chief Tess ) Magic Man ( Wise Old Man ) Zarosian II ( Soran, Emissary of Zaros ) Time Served Legatus pendant 1,423.3 4 Cell, a Door Museum - Zarosian II ( Velucia ) Blingy Fings ( Chief Tess ) Zarosian II ( Soran, Emissary of Zaros ) Legatus barrier and The Vault of Shadows (tool belt)"
    },
    {
        "levels": "48-51",
        "method": "Return to the Everlight - Mass grave excavation site at Everlight Dig Site. Excavate the monoceros remains . If you have not already collected the four queen's journal pages and icyene remains, find these and complete Queen of the Icyene and Fallen Angels mysteries before moving on. Artefacts from Monoceros remains Artefact Restore XP Needed From research Collections Other uses Ceremonial unicorn ornament 1,493.3 4 N/A Museum - Saradominist I ( Velucia ) Hat Hoarder ( Wise Old Man ) Saradominist I ( Sir Atcha ) Eduardo Ceremonial unicorn saddle 1,493.3 2 N/A Museum - Saradominist I ( Velucia ) Saradominist I ( Sir Atcha ) N/A"
    },
    {
        "levels": "51–56",
        "method": "At level 51 switch to the amphitheatre debris excavation hotpots at the Everlight - Amphitheatre excavation site . With level 40 Construction and 10 white marble (unnoted) the Statue of Mesomedes can be repaired. A restored everlight harp can then be added to the statue to gain 1,278 Archaeology experience and a hand of glory . Artefacts from Amphitheatre debris Artefact Restore XP Needed From research Collections Other uses Everlight harp 1,703.3 4 Ode to a Midsummer Morning Museum - Saradominist I ( Velucia ) Wise Am the Music Man ( Wise Old Man ) Saradominist I ( Sir Atcha ) Statue of Mesomedes Everlight trumpet 1,703.3 5 N/A Museum - Saradominist I ( Velucia ) Smoky Fings ( Chief Tess ) Wise Am the Music Man ( Wise Old Man ) Saradominist I ( Sir Atcha ) That Old Black Magic: Skelly By Everlight Everlight violin 1,703.3 3 N/A Museum - Saradominist I ( Velucia ) Wise Am the Music Man ( Wise Old Man ) Saradominist I ( Sir Atcha ) N/A"
    },
    {
        "levels": "56–58",
        "method": "Move to the ceramics studio debris hotspots at level 56. You should now be able to fully complete the Museum - Saradominist I and Saradominist I artefact collections for the first time. Artefacts from Ceramics studio debris Artefact Restore XP Needed From research Collections Other uses Folded-arm figurine (female) 2,053.3 2 N/A Museum - Saradominist I ( Velucia ) Saradominist I ( Sir Atcha ) N/A Folded-arm figurine (male) 2,053.3 2 N/A Museum - Saradominist I ( Velucia ) Saradominist I ( Sir Atcha ) N/A"
    },
    {
        "levels": "58-60",
        "method": "Return to the Kharid-et - Carcerem excavation site and pass through the legatus barrier to excavate the carcerem debris . One more 'Incite Fear' spell scroll is required to complete The Vault of Shadows quest. An additional restored pontifex signet ring should be added to the tool belt to allow the player to pass through the pontifex barrier to access further excavation hotspots. You may also wish to create a pontifex observation ring , which uses another pontifex signet ring. Artefacts from Carcerem debris Artefact Restore XP Needed From research Collections Other uses Pontifex signet ring 2,193.3 5 Lockdown Museum - Zarosian II ( Velucia ) Blingy Fings ( Chief Tess ) Zarosian II ( Soran, Emissary of Zaros ) Pontifex barrier and The Vault of Shadows (tool belt) Pontifex observation ring 'Incite Fear' spell scroll 2,193.3 5 N/A Museum - Zarosian II ( Velucia ) Magic Man ( Wise Old Man ) Zarosian II ( Soran, Emissary of Zaros ) Imperial Sorcery ( Eblis ) The Vault of Shadows"
    },
    {
        "levels": "60-61",
        "method": "At level 60 you can access the Senntisten Dig Site and excavate the ministry remains at the Senntisten - Cathedral excavation site . You can obtain the first Inquisitor's Memoirs page from this hotspot; this is required for the Secrets of the Inquisition mystery, a restored funerary urn of shadow is also needed. Ancient glass shards are found while excavating throughout the Senntisten Dig Site. These can be used to repair the four broken stained glass windows in the cathedral . To fully repair each window 100 ancient glass shards and level 80 Crafting are required. Repairing all the windows completes the Pane in the Glass achievement. Artefacts from Ministry remains Artefact Restore XP Needed From research Collections Other uses Apex cap 2,333.3 2 N/A Museum - Zarosian V ( Velucia ) Religious Iconography ( Eblis ) N/A Curse tablet 2,333.3 2 N/A Museum - Zarosian V ( Velucia ) Imperial Sorcery ( Eblis ) N/A Funerary urn of shadow 2,333.3 3 The Hidden Chamber Museum - Zarosian V ( Velucia ) Urns of the Empire ( Eblis ) Secrets of the Inquisition"
    },
    {
        "levels": "61-62",
        "method": "Return to the Everlight - Dominion Games stadium excavation site and excavate stadio debris . While excavating here you will be able to find five athlete's journal pages and complete the Fall and Rise mystery. These can also be found later while excavating at other hotspots in the Dominion Games stadium excavation site at level 69 and 100. You should now be able to complete the Museum - Zarosian V and Museum - Zarosian VI collections for the first time. Artefacts from Stadio debris Artefact Restore XP Needed From research Collections Other uses Dominion discus 2,566.7 2 N/A Museum - Saradominist II ( Velucia ) Saradominist II ( Sir Atcha ) N/A Dominion javelin 2,566.7 2 N/A Museum - Saradominist II ( Velucia ) Saradominist II ( Sir Atcha ) N/A Dominion pelte shield 2,566.7 2 N/A Museum - Saradominist II ( Velucia ) Saradominist II ( Sir Atcha ) N/A"
    },
    {
        "levels": "62-63",
        "method": "Go to the Senntisten - Cathedral excavation site and excavate the cathedral debris .  You can obtain the second Inquisitor's Memoirs page from this hotspot; this is required for the Secrets of the Inquisition mystery, a restored funerary urn of smoke is also needed. Pages one and two of A critic's review can only be obtained from cathedral debris; these are needed later to complete the Night Theatre mystery. Artefacts from Cathedral debris Artefact Restore XP Needed From research Collections Other uses Infula robes 2,800 2 N/A Museum - Zarosian V ( Velucia ) Religious Iconography ( Eblis ) N/A Funerary urn of smoke 2,800 3 Crossing that Bridge Museum - Zarosian V ( Velucia ) Urns of the Empire ( Eblis ) Secrets of the Inquisition Hand of the Ancients 2,800 2 N/A Museum - Zarosian V ( Velucia ) Imperial Sorcery ( Eblis ) N/A"
    },
    {
        "levels": "63-64",
        "method": "Move to the Senntisten - Marketplace excavation site at level 63 and collect from the marketplace debris . You can obtain the third Inquisitor's Memoirs page from this hotspot;  a restored funerary urn of ice is also needed. A critic's review (article 4) (for the Night Theatre mystery) and a warning letter (for the Empty Children mystery) can only be obtained from the marketplace debris. You should also complete the Complete the Pattern, Solve the Puzzle special research. Artefacts from Marketplace debris Artefact Restore XP Needed From research Collections Other uses Decorative amphora 3,033.3 2 N/A Museum - Zarosian VI ( Velucia ) Entertaining the Masses ( Eblis ) N/A Funerary urn of ice 3,033.3 3 Prime Real Estate Museum - Zarosian VI ( Velucia ) Urns of the Empire ( Eblis ) Secrets of the Inquisition Loarnab rod 3,033.3 2 N/A Museum - Zarosian VI ( Velucia ) Religious Iconography ( Eblis ) N/A"
    },
    {
        "levels": "64-65",
        "method": "At level 64 move to the inquisitor remains in the marketplace excavation site. A critic's review (article 3) and pages three and four of the Inquisitor's Memoirs can only be uncovered at this excavation hotspot. You can complete the Finery of the Inquisition collection at this point. Artefacts from Inquisitor remains Artefact Restore XP Needed From research Collections Other uses Inquisitor's seal 3,266.7 2 N/A Museum - Zarosian VI ( Velucia ) Finery of the Inquisition ( Eblis ) N/A Inquisitor's ceremonial mask 3,266.7 2 N/A Museum - Zarosian VI ( Velucia ) Finery of the Inquisition ( Eblis ) N/A Inquisitor's ceremonial armour 3,266.7 2 N/A Museum - Zarosian VI ( Velucia ) Finery of the Inquisition ( Eblis ) N/A"
    },
    {
        "levels": "65-66",
        "method": "At level 65 go to the Infernal Source - Vestibule of Futility south excavation site and train at the Infernal Source - Vestibule of Futility south-east excavation site . Artefacts from Infernal art Artefact Restore XP Needed From research Collections Other uses 'Lust' metal sculpture 3,500 3 N/A Museum - Zamorakian II ( Velucia ) Showy Fings ( Chief Tess ) Zamorakian II ( Isaura ) N/A 'The Lake of Fire' painting 3,500 3 N/A Anarchic Abstraction ( Art Critic Jacques ) Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) N/A"
    },
    {
        "levels": "66-67",
        "method": "Return to the Senntisten - Marketplace excavation site and begin excavating the gladiator remains . At the colosseum gateway use the \"enter (non combat)\" option. While here you can obtain the fourth page of the Inquisitor's Memoirs and progress the Secrets of the Inquisition mystery using a restored funerary urn of blood, along with the three other funerary urns from previous excavation hotspots. It is recommended to complete up until the point where the Crossing that Bridge special research is sent out as soon as you can, as this is required to unlock the next excavation site. Additionally a scrawled note (for the Empty Children mystery) can only be obtained from this hotspot. After this has been obtained the mystery can be completed. Artefacts from Gladiator remains Artefact Restore XP Needed From research Collections Other uses Gladiator sword 3,773.3 2 N/A Museum - Zarosian VII ( Velucia ) Entertaining the Masses ( Eblis ) N/A Gladiator helmet 3,773.3 2 N/A Museum - Zarosian VII ( Velucia ) Entertaining the Masses ( Eblis ) N/A Funerary urn of blood 3,773.3 3 Are You Not Entertained? Museum - Zarosian VII ( Velucia ) Urns of the Empire ( Eblis ) Secrets of the Inquisition"
    },
    {
        "levels": "67-68",
        "method": "Once you have reached level 67 and have completed the Crossing that Bridge research you can move to the Senntisten - Bridge excavation site . Excavate the citizen remains there. Pages six and seven of the Inquisitor's Memoirs can only be obtained at this site. The eighth page can only be obtained from the ministry remains hotspot after these have been obtained, so you will have to backtrack at this point to find it. You can then complete the Secrets of the Inquisition mystery. The fifth critic's review article can also only be obtained here, after finding it the Night Theatre mystery can be completed. There are four artefact collections which can be completed after this excavation hotspot: Museum - Zarosian VII , Entertaining the Masses , Religious Iconography , and Urns of the Empire . Artefacts from Citizen remains Artefact Restore XP Needed From research Collections Other uses 'The Serpent's Fall' carving 3,966.7 2 N/A Museum - Zarosian VII ( Velucia ) Religious Iconography ( Eblis ) N/A Model chariot 3,966.7 2 N/A Museum - Zarosian VII ( Velucia ) Entertaining the Masses ( Eblis ) N/A Funerary urn of miasma 3,966.7 2 N/A Museum - Zarosian VII ( Velucia ) Urns of the Empire ( Eblis ) N/A"
    },
    {
        "levels": "68-69",
        "method": "At level 68 go to the Infernal Source - Vestibule of Futility north-east excavation site at the Infernal Source Dig Site . Excavate the shakroth remains . Before handing in the spiked collars you may want to complete the Who's a Bad Boy? achievement; the collar is not consumed while doing so. An additional restored chaos star can be added to your tool belt to prevent portals in the area from misfiring. You can then complete the Dagon Bye mystery, as it requires having a chaos star but one stored in the tool belt will work. After completing this mystery you should have completed all the Infernal Source site mysteries and will be able to recruit Movario to your research team. The Blingy Fings artefact collection can be fully completed for the first time at this point. Artefacts from Shakroth remains Artefact Restore XP Needed From research Collections Other uses Chaos star 4,200 4 Who Dis? Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) Dagon Bye (tool belt) Abyssal Gatestone Spiked dog collar 4,200 2 Deeper and Down Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) Who's a Bad Boy? (not consumed)"
    },
    {
        "levels": "69-70",
        "method": "Return to the Dominion Games stadium excavation site and excavate the dominion games podium hotspots. Obtain three bronze dominion medals , three dominion torchs , and three silver dominion medals for collections. One dominion torch can be obtained by completing the Stadio Ga Ga special research mission. Restore the statue of Padosan with level 40 Construction and 10 white marble . Add a restored dominion torch to gain 2,470 Archaeology experience. Another dominion torch is required to complete the Hallowed Be... mystery later on. If you have not already, obtain all of the five athlete's journal pages and complete the Fall and Rise mystery. Artefacts from Dominion Games podium Artefact Restore XP Needed From research Collections Other uses Bronze Dominion medal 4,433.3 3 N/A Museum - Saradominist II ( Velucia ) Blingy Fings ( Chief Tess ) Saradominist II ( Sir Atcha ) N/A Silver Dominion medal 4,433.3 3 N/A Museum - Saradominist II ( Velucia ) Blingy Fings ( Chief Tess ) Saradominist II ( Sir Atcha ) N/A Dominion torch 4,433.3 5 Stadio Ga Ga Museum - Saradominist II ( Velucia ) Smoky Fings ( Chief Tess ) Saradominist II ( Sir Atcha ) Statue of Padosan Hallowed Be... With at least level 70 Archaeology the associate qualificiation can be unlocked by meeting the achievements listed below and talking to Acting Guildmaster Reiniger : Qualification - Assistant ( 10) – Complete all of the listed achievements and attend the qualification ceremony. Archaeology 70 ( 5) – Reach level 70 in the Archaeology skill. Mystery Solver IV ( 15) – Solve 10 of Gielinor's greatest mysteries. Collectors Assemble III ( 10) – Complete 5 unique collections for archaeological collectors. (X/5) The Discoverer VII ( 30) – Excavate damaged artefacts. (X/250) The Restorer VII ( 30) – Restore damaged artefacts. (X/250) The Researcher I ( 5) – Send your research team out on field studies. Tracked in hours. (X/24) However, you are not likely to have found and restored enough artefacts at this point to be able to complete the qualification straight away. You can either opt to continue training and unlock the qualification once you hit the required number of artefacts or return to a low level spot where artefacts can be uncovered and restored quickly. Venator remains work well for this. If you wish to complete collections for a better experience rate you could complete the Zarosian I or Museum - Zarosian I collections, both of which give a 4,271.8 experience completion bonus. With the associate qualification unlocked you can purchase the next set of upgrades from the Archaeology Guild Shop . You should purchase the upgrades to the soil box 's capacity, material storage containers ' capacity, and base mattock precision. You can also purchase the archaeologist's outfit , which gives a 5% increased experience gain when the full set is worn. You may wish to purchase the blueprints for the auto-screener v1.080 , which requires level 67 Invention to manufacture. With the auto-screener soil is automatically converted into materials available at the excavation hotspot that the player is using. The auto-screener does not yield any damaged artefacts or yield any Archaeology or Invention experience when converting soil. After completing the qualification three material manuals , three hi-spec monocles , three tarpaulin sheets , and three cups of archaeologist's tea may be claimed from Acting Guildmaster Reiniger by talking to her. You can now also recruit Alpheus and Eliza to your research team. They are located on Anachronia and will ask to join your team if you show them a completed totem . You can complete the Mysterious Monolith: Architecture special research."
    },
    {
        "levels": "70-72",
        "method": "At level 70 you will be invited to go to the Stormguard Citadel Dig Site . Head to the Temple of Ikov and study the northern or southern archway to uncover the Ikovian Tragedy special research. Send off your research team and start excavating the Ikovian memorial hotspots. Once you have obtained and restored an Ikovian gerege , either from the hotspots or from completing the special research, add it to your tool belt . Enter the citadel and continue excavating the Ikovian memorials . While excavating the Ikovian memorial hotspots inside the citadel there is a chance that you will find the boots of flight . When you find them you can add them to your tool belt and complete the Leap of Faith mystery. The exile's vow can only be found while excavating Ikovian memorial hotspots. When this is found talk to Gee'ka to complete the Atonement mystery. You can now complete the Museum - Saradominist II and Saradominist II collections for the first time. While excavating at hotspots within the Stormguard Citadel you can find torn blueprint fragments which are used to create blueprints for Ancient Invention ; however this cannot be unlocked until you reach level 95 Archaeology. Artefacts from Ikovian memorial Artefact Restore XP Needed From research Collections Other uses Ikovian gerege 4,666.7 4 Ikovian Tragedy Museum - Armadylean I ( Velucia ) Knowledge is Power ( Wise Old Man ) Armadylean I ( Lowse ) Teleport using the Stormguard portal (tool belt) Toy glider 4,666.7 2 N/A Museum - Armadylean I ( Velucia ) Armadylean I ( Lowse ) N/A Toy war golem 4,666.7 2 N/A Museum - Armadylean I ( Velucia ) Armadylean I ( Lowse ) N/A"
    },
    {
        "levels": "72-73",
        "method": "Return to the Everlight - Oikoi excavation site and excavate the oikos studio debris piles. You may find a psiloi buckler while excavating here, this and a restored kantharos cup should be kept to complete The Everlight mystery later on. The four pages of Archon's journal may be found here, or at level 84 at the oikos fishing hut remnants. If you get them all complete The Dour of Bable mystery. Artefacts from Oikos studio debris Artefact Restore XP Needed From research Collections Other uses Decorative vase 5,133.3 2 N/A Museum - Saradominist II ( Velucia ) Saradominist II ( Sir Atcha ) N/A Patera bowl 5,133.3 2 N/A Museum - Saradominist II ( Velucia ) Saradominist II ( Sir Atcha ) N/A Kantharos cup 5,133.3 3 Home, Sweet Home Museum - Saradominist II ( Velucia ) Saradominist II ( Sir Atcha ) The Everlight"
    },
    {
        "levels": "73-74",
        "method": "At level 73 you will be able to use the Daemonheim Dig Site for the first time. To use the dig site you will need to have freed Skaldrun while completing frozen floors while dungeoneering . Head to the Daemonheim - Castle excavation site and excavate the castle hall rubble . Obtain Balarak's and Tokshak's rings , which can only be obtained at the castle hall rubble hotspots, and complete A New Home mystery. Artefacts from Castle hall rubble Artefact Restore XP Needed From research Collections Other uses Castle gatestone 5,366.7 2 N/A Dragonkin V ( Sharrigan ) Museum - Dragonkin V ( Velucia ) N/A Engraved ring of kinship 5,366.7 2 N/A Dragonkin V ( Sharrigan ) Museum - Dragonkin V ( Velucia ) N/A"
    },
    {
        "levels": "74-76",
        "method": "Excavate the Kharid-et chapel debris . You may start to find the three pages of the pater's log here. They may also be found at later excavation hotspots. When you have found them all complete The Cult of Orcus mystery. Artefacts from Kharid-et chapel debris Artefact Restore XP Needed From research Collections Other uses Ceremonial mace 5,600 3 N/A Museum - Zarosian II ( Velucia ) Hitty Fings ( Chief Tess ) Zarosian II ( Soran, Emissary of Zaros ) N/A Pontifex Maximus figurine 5,600 3 N/A Museum - Zarosian II ( Velucia ) Showy Fings ( Chief Tess ) Zarosian II ( Soran, Emissary of Zaros ) City of Senntisten (obtained and consumed during quest) 'Consensus ad Idem' painting 5,600 3 N/A Museum - Zarosian II ( Velucia ) Imperial Impressionism ( Art Critic Jacques ) Zarosian II ( Soran, Emissary of Zaros ) N/A"
    },
    {
        "levels": "76-77",
        "method": "First return to the Stormguard Citadel Dig Site . If you have not already obtained the Boots of Flight from the Ikovian memorial hotspot excavate this now as they become a guaranteed drop at level 76 Archaeology. When you have the boots find the damaged wingsuit v1 , restore it, and add it to you tool belt. Find two lightning conductors to upgrade to the wingsuit v2 and then two gravitron repulsors to upgrade to the wingsuit v3 . Complete the Wing Out mystery once you have fully upgraded the wingsuit. Excavate the keshik ger hotspots at the Stormguard Citadel - Keshik memorial excavation site . You may start to find the three mission reports required to complete The Spy Who Loved Metal mystery, though these can also be found later on. Once you have completed Wing Out and have restored the required artefacts, swap to the Warforge Dig Site . Artefacts from Keshik ger Artefact Restore XP Needed From research Collections Other uses Avian song-egg player 6,066.7 3 N/A Museum - Armadylean I ( Velucia ) Wise Am the Music Man ( Wise Old Man ) Armadylean I ( Lowse ) N/A Keshik drum 6,066.7 3 N/A Museum - Armadylean I ( Velucia ) Wise Am the Music Man ( Wise Old Man ) Armadylean I ( Lowse ) N/A Morin khuur 6,066.7 3 N/A Museum - Armadylean I ( Velucia ) Wise Am the Music Man ( Wise Old Man ) Armadylean I ( Lowse ) N/A Maximising time at the Warforge site over the Stormguard Citadel is recommended as you will obtain the pieces required to forge the imcando mattock here. Talk to Zanik at the Warforge to view the introductory cutscene. Excavate the gladiatorial goblin remains at the Warforge - Crucible arena excavation site . You may start to find some of the five pages for The First Commander mystery, though these can also be found at later excavation hotspots. Artefacts from Gladiatorial goblin remains Artefact Restore XP Needed From research Collections Other uses Ekeleshuun blinder mask 6,066.7 3 N/A Museum - Bandosian I ( Velucia ) Hat Problem ( Wise Old Man ) Green Gobbo Goodies I ( General Wartface ) N/A Narogoshuun 'Hob-da-Gob' ball 6,066.7 2 N/A Museum - Bandosian I ( Velucia ) Green Gobbo Goodies I ( General Wartface ) N/A Rekeshuun war tether 6,066.7 2 N/A Museum - Bandosian I ( Velucia ) Green Gobbo Goodies I ( General Wartface ) N/A"
    },
    {
        "levels": "77-78",
        "method": "Return to the Daemonheim - Castle excavation site and excavate the tunnelling equipment repository . Find Halak's ring for the A New Home mystery; it can only be found at this hotspot. You can now complete Dragonkin V and Museum - Dragonkin V for the first time. Artefacts from Tunnelling equipment repository Artefact Restore XP Needed From research Collections Other uses Exploratory totem 6,300 2 N/A Dragonkin V ( Sharrigan ) Museum - Dragonkin V ( Velucia ) N/A Excavator portal mine 6,300 2 N/A Dragonkin V ( Sharrigan ) Museum - Dragonkin V ( Velucia ) N/A"
    },
    {
        "levels": "78-81",
        "method": "At level 78 move to the botanical reserves on the 1 st floor  2 nd floor  of the Daemonheim dig site. Find Yorga's pipe for the A New Home mystery; it can only be found at this site. If you have not already found all four pieces for the imcando mattock then return to the gladiatorial goblin remains after finding the pipe and the artefacts needed from the botanical reserves. Artefacts from Botanical reserve Artefact Restore XP Needed From research Collections Other uses Storage totem 6,533.3 2 N/A Dragonkin VI ( Sharrigan ) Museum - Dragonkin VI ( Velucia ) N/A Plant seed satchel 6,533.3 2 N/A Dragonkin VI ( Sharrigan ) Museum - Dragonkin VI ( Velucia ) N/A Snuff box 6,533.3 2 Rest at the New Frontier Dragonkin VI ( Sharrigan ) Museum - Dragonkin VI ( Velucia ) N/A"
    },
    {
        "levels": "81-83",
        "method": "There are four different excavation hotspots available at level 81 Archaeology, so you will hop between them until you have the required artefacts from each. At the Infernal Source - Vestibule of Futility south-east excavation site excavate the animal trophies . Complete the Zamorakian II and Museum - Zamorakian II collections by handing in artefacts to Isaura and Velucia . Artefacts from Animal trophies Artefact Restore XP Needed From research Collections Other uses Larupia trophy 7,388.9 2 N/A Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) N/A Lion trophy 7,388.9 2 N/A Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) N/A She-wolf trophy 7,388.9 2 N/A Museum - Zamorakian II ( Velucia ) Zamorakian II ( Isaura ) N/A At the Stormguard Citadel - Relay station excavation site excavate the tailory debris . If you have not already completed The Spy Who Loved Metal , obtain the three required mission reports from this hotspot and complete the mystery as this is the last hotspot where the reports will be obtained. An aviansie dreamcoat can be given to Armadyl at the top of his tower to obtain the ring of Solomon , which is used to unlock the Death Ward relic power . Hand in artefacts to Lowse and Velcuia to complete the Armadylean I and Museum - Armadylean I collections for the first time. Artefacts from Tailory debris Artefact Restore XP Needed From research Collections Other uses Aviansie dreamcoat 7,388.9 3 Deer-ly Departed Museum - Armadylean I ( Velucia ) Armadylean I ( Lowse ) Ring of Solomon Ceremonial plume 7,388.9 3 N/A Museum - Armadylean I ( Velucia ) Showy Fings ( Chief Tess ) Armadylean I ( Lowse ) N/A Peacocking parasol 7,388.9 2 N/A Museum - Armadylean I ( Velucia ) Armadylean I ( Lowse ) N/A At the Kharid-et - Chapel excavation site excavate the pontifex remains . Complete the Zarosian II , Museum - Zarosian II , and Smoky Fings collections for the first time by handing in the required artefacts. Artefacts from Pontifex remains Artefact Restore XP Needed From research Collections Other uses Pontifex censer 7,388.9 3 N/A Museum - Zarosian II ( Velucia ) Smoky Fings ( Chief Tess ) Zarosian II ( Soran, Emissary of Zaros ) N/A Pontifex crozier 7,388.9 3 N/A Museum - Zarosian II ( Velucia ) Hitty Fings ( Chief Tess ) Zarosian II ( Soran, Emissary of Zaros ) N/A Pontifex mitre 7,388.9 3 N/A Museum - Zarosian II ( Velucia ) Hat Hoarder ( Wise Old Man ) Zarosian II ( Soran, Emissary of Zaros ) N/A Finally, return to the Warforge Dig Site and excavate crucible stands debris . Continue at this excavation hotspot until you reach level 83 to maximise your chances of finding all pieces of the imcando mattock. Artefacts from Crucible stands debris Artefact Restore XP Needed From research Collections Other uses Ogre Kyzaj axe 7,388.9 2 N/A Museum - Bandosian I ( Velucia ) Red Rum Relics I ( General Bentnoze ) N/A Ork cleaver sword 7,388.9 2 N/A Museum - Bandosian I ( Velucia ) Red Rum Relics I ( General Bentnoze ) N/A"
    },
    {
        "levels": "83-84",
        "method": "At level 83 excavate the barricade in the Warforge Dig Site; fully removing it completes the Out of the Crucible mystery and allows access to the Warforge - South goblin tunnels excavation site . Enter the area and investigate the doors to Thalmund's Forge to begin the Into the Forge mystery. Complete the mystery by finding 11 keys throughout the area; this requires 35 Dungeoneering and 28 Fishing . After completing the mystery you can access the forge and create an imcando mattock once you have found all four imcando metal pieces. Excavate the goblin dorm debris . You can complete your first Green Gobbo Goodies I collection by handing in artefacts to General Wartface . Artefacts from Goblin dorm debris Artefact Restore XP Needed From research Collections Other uses Thorobshuun battle standard 8,166.7 3 Melting Point Museum - Bandosian I ( Velucia ) Green Gobbo Goodies I ( General Wartface ) Red hand cave painting Yurkolgokh stink grenade 8,166.7 2 N/A Museum - Bandosian I ( Velucia ) Green Gobbo Goodies I ( General Wartface ) N/A"
    },
    {
        "levels": "84-85",
        "method": "Go to the Everlight - Oikoi excavation site and excavate the Oikos fishing hut remnants . If you have not already completed The Dour of Bable mystery make sure you have obtained the four pages of Archon's journal and complete it now, as this is the last excavation hotspot that they can be obtained from. Artefacts from Oikos fishing hut remnants Artefact Restore XP Needed From research Collections Other uses Dominarian device 8,555.6 3 Like Clockwork Museum - Saradominist III ( Velucia ) Saradominist III ( Sir Atcha ) Andvaranaut Fishing trident 8,555.6 3 N/A Museum - Saradominist III ( Velucia ) Hitty Fings ( Chief Tess ) Saradominist III ( Sir Atcha ) N/A"
    },
    {
        "levels": "85-86",
        "method": "At the Stormguard Citadel - Research & Development north-west excavation site excavate the weapons research debris . Restore two hawkeye lens multi-vision scopes and two talon-3 razor wings for collections. You may start to find project pages required for the A Study in Aether mystery here, and at later hotspots. If you have level 70 Divination you may wish to activate the nearby stormguard portal , using 20 unnoted quintessence , for easy access to the excavation hotspot. Artefacts from weapons research debris Artefact Restore XP Needed From research Collections Other uses Hawkeye lens multi-vision scope 8,944.4 2 N/A Museum - Armadylean II ( Velucia ) Armadylean II ( Lowse ) N/A Talon-3 razor wing 8,944.4 2 N/A Museum - Armadylean II ( Velucia ) Armadylean II ( Lowse ) N/A"
    },
    {
        "levels": "86-87",
        "method": "Go to the Kharid-et - Chapel excavation site and excavate the orcus altars . Obtain an additional restored spell scroll if you want to complete The Vault of Shadows , as one is consumed during the quest. A restored necromantic focus is also required for the Tomes of the Warlock quest. This is the final hotspot where the three pater's log pages can be found, so obtain these and complete The Cult of Orcus mystery if you have not already done so. Artefacts from Orcus altar Artefact Restore XP Needed From research Collections Other uses Necromantic focus 9,333.3 5 Requiescat in Pace Nom-Nom-Nom-Nom Museum - Zarosian III ( Velucia ) Knowledge is Power ( Wise Old Man ) Zarosian III ( Soran, Emissary of Zaros ) Imperial Sorcery ( Eblis ) Tomes of the Warlock 'Exsanguinate' spell scroll 9,333.3 5 N/A Museum - Zarosian III ( Velucia ) Magic Man ( Wise Old Man ) Zarosian III ( Soran, Emissary of Zaros ) Imperial Sorcery ( Eblis ) The Vault of Shadows"
    },
    {
        "levels": "87-89",
        "method": "Return to the Daemonheim - Castle excavation site and excavate the communal space spots on the ground floor  1 st floor  . Add a restored 'friendship bracelet' to your tool belt to allow access to the Daemonheim - Depths excavation site . Find the tarnished plaque , which can only be found at the communal space hotspots, and complete the A New Home mystery. You can complete the Dragonkin VI and Museum - Dragonkin VI collections after this site. Hand in the artefacts to Sharrigan and Velucia . Artefacts from Communal space Artefact Restore XP Needed From research Collections Other uses Spent summoning charm 9,722.2 2 N/A Dragonkin VI ( Sharrigan ) Museum - Dragonkin VI ( Velucia ) N/A 'Friendship bracelet' 9,722.2 3 N/A Dragonkin VI ( Sharrigan ) Museum - Dragonkin VI ( Velucia ) Access to the Daemonheim - Depths excavation site (tool belt) Homely totem 9,722.2 2 N/A Dragonkin VI ( Sharrigan ) Museum - Dragonkin VI ( Velucia ) N/A"
    },
    {
        "levels": "89-90",
        "method": "Excavate dis overspill at the Infernal Source - The Harrowing south-east excavation site . Artefacts from Dis overspill Artefact Restore XP Needed From research Collections Other uses 'Torment' metal sculpture 10,500 2 N/A Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A 'Pandemonium' tapestry 10,500 3 N/A Anarchic Abstraction ( Art Critic Jacques ) Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A Once you have the required artefacts from the Infernal Source, go to the Warforge - North goblin tunnels and excavate from the Big High War God shrine hotspots. You may find the Forge War! page here and hand it in to complete the Forge War! mystery, but this can also be completed at later hotspots. The Museum - Bandosian I , Hitty Fings , and Anarchic Abstraction collections can be completed at this point. Artefacts from Big High War God shrine Artefact Restore XP Needed From research Collections Other uses High priest crozier 10,500 3 N/A Museum - Bandosian I ( Velucia ) Hitty Fings ( Chief Tess ) Green Gobbo Goodies II ( General Wartface ) N/A High priest mitre 10,500 4 N/A Museum - Bandosian I ( Velucia ) Hat Problem ( Wise Old Man ) Magic Man ( Wise Old Man ) Green Gobbo Goodies II ( General Wartface ) N/A High priest orb 10,500 3 N/A Museum - Bandosian I ( Velucia ) Hitty Fings ( Chief Tess ) Green Gobbo Goodies II ( General Wartface ) N/A With at least level 90 Archaeology the professor qualification can be unlocked by meeting the achievements listed below and talking to Acting Guildmaster Reiniger : Qualification - Associate ( 25) – Complete all of the listed achievements and attend the qualification ceremony. Archaeology 90 ( 5) – Reach level 90 in the Archaeology skill. Mystery Solver V ( 25) – Solve 15 of Gielinor's greatest mysteries. Collectors Assemble VI ( 40) – Complete 20 unique collections for archaeological collectors. (X/20) The Discoverer VIII ( 40) – Excavate damaged artefacts. (X/500) The Restorer VIII ( 40) – Restore damaged artefacts. (X/500) The Researcher III ( 10) – Send your research team out on field studies. Tracked in hours. (X/72) If you have completed all the artefact collections and mysteries up until this point you will have completed a total of 32/20 unique artefact collections and 22/15 mysteries required for the qualification. However, you are not likely to have found and restored enough artefacts at this point to be able to complete the qualification straight away. You can either opt to continue training and unlock the qualification once you hit the required number of artefacts or return to complete quick collections of artefacts to meet the requirement. Completion of Green Gobbo Goodies I or Green Gobbo Goodies II is recommended if you wish to do this. For more information see here . When you have unlocked the professor qualification you can complete the Mysterious Monolith: Symbology special research and automatically unlock Drew , Helen , and Easty for your research team. You can now purchase another set of upgrades from the Archaeology Guild Shop : to the soil box 's capacity, material storage containers' capacity, and base mattock precision . You can also purchase an additional relic loadout slot if you wish. Four material manuals , four hi-spec monocles , four tarpaulin sheets , and four cups of archaeologist's tea may be claimed from Acting Guildmaster Reiniger by talking to her after completing the qualification."
    },
    {
        "levels": "90-91",
        "method": "You can now access the Orthen Dig Site on Anachronia for the first time. Upon arriving speak to Mr Mordaut to view a cutscene; active the inactive teleport device east of the base camp lodestone; and then head to the Orthen - Crypt of Varanus excavation site . Activate the Orthen teleportation device outside the crypt, which unlocks the Incomplete Portal Network I special research and progresses the Teleport Node On mystery, then enter the site and excavate the varanusaur remains . Study the funeral pyre in the centre of the room to unlock the Breath of Fire special research mission. While excavating here you may find the four pages required to complete Crypt o' Zoology ; though these can also be found at later hotspots. While excavating at this hotspot or the dragonkin reliquary excavation hotspots at level 96, you may find four fragments of the Archaeology potion recipe . With level 90 Archaeology to the Know Thy Measure mystery can be completed. The Orthen Dig Site has a mechanic similar to the pylon at the Al-Kharid dig site. While excavating here you can find rex skeleton fragments which can be used to restore the rex skeleton at Anachronia base camp . When the skeleton has been fully completed by players across all game worlds the Roar of Osseous buff is activated. This gives 25% increased experience and a 10% increased chance to receive materials while training Archaeology on Anachronia for 65 minutes. Artefacts from Varanusaur remains Artefact Restore XP Needed From research Collections Other uses Pasaha 10,888.9 3 N/A Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) Artificer's measure Ritual bell 10,888.9 2 N/A Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) N/A With level 90 Archaeology and completion of Desperate Measures you can excavate at the Orthen - Nodon hibernatorium excavation site 's orthen rubble hotspot. Excavate the orthen rubble and dragonkin remains until you have found the ceremonial dragonkin device and ceremonial dragonkin tablet . Each of these can only be obtained once. Restore them and hand them in to Giles to complete the Desperate for Artefacts collection, which awards a cosmic pyramid . The pyramid can be combined with the cosmic focus to create the cosmic accumulator . The cosmic accumulator prevents sprite focus from dropping below 20% while excavating and can provide a buff to sprite focus gain while excavating a hotspot with a time sprite active on it."
    },
    {
        "levels": "91-92",
        "method": "At level 91 move back to the Stormguard Citadel - Research & Development north-west excavation site . Excavate the gravitron research debris . Complete the Wise Am the Music Man collection by handing in artefacts to the Wise Old Man . Using either an imcando or elder rune mattock with all available mattock upgrades and wearing the full archaeologist's outfit , experience rates average around 117,000 experience an hour at these spots. Artefacts from Gravitron research debris Artefact Restore XP Needed From research Collections Other uses Prototype gravimeter 11,277.8 2 N/A Museum - Armadylean II ( Velucia ) Armadylean II ( Lowse ) N/A Songbird recorder 11,277.8 3 N/A Museum - Armadylean II ( Velucia ) Wise Am the Music Man ( Wise Old Man ) Armadylean II ( Lowse ) N/A"
    },
    {
        "levels": "92-93",
        "method": "Return to the Everlight - Acropolis excavation site and excavate the acropolis debris . You can now complete the Showy Fings collection with Chief Tess for the first time.One restored rod can be added to the statue of Tromple once it has been restored using 10 white marble with level 40 Construction . The completed statue can be opened to receive the 'Tromple's Troubling Tales' experience book, which grants 50,000 Archaeology experience when it is read. This should also complete the No Secrets Left to Steal achievement. At this site you may start to find the five excerpts of the Epic of Hebe, which are required to complete The Epic of Hebe mystery. They can also be found later on at the level 109 excavation site. Artefacts from Acropolis debris Artefact Restore XP Needed From research Collections Other uses Amphora 11,666.7 2 N/A Museum - Saradominist III ( Velucia ) Saradominist III ( Sir Atcha ) N/A Rod of Asclepius 11,666.7 4 Ground of the Polis Museum - Saradominist III ( Velucia ) Showy Fings ( Chief Tess ) Saradominist III ( Sir Atcha ) Statue of Tromple"
    },
    {
        "levels": "93-94",
        "method": "Go to the Kharid-et - Culinarum excavation site and get two Zarosian ewers and Zarosian steins from the armarium debris . Using either an imcando or elder rune mattock with all available mattock upgrades and wearing the full archaeologist's outfit , experience rates average around 120,000-130,000 experience an hour at these spots, plus any additional experience from handing in pylon batteries. Artefacts from Armarium debris Artefact Restore XP Needed From research Collections Other uses Zarosian ewer 12,500 2 N/A Museum - Zarosian III ( Velucia ) Zarosian III ( Soran, Emissary of Zaros ) N/A Zarosian stein 12,500 2 N/A Museum - Zarosian III ( Velucia ) Zarosian III ( Soran, Emissary of Zaros ) N/A"
    },
    {
        "levels": "94-95",
        "method": "Excavate the Yu'biusk animal pen hotspots at the Warforge - Animal pens excavation site . You can hand in the Red Rum Relics I collection to General Bentnoze for the first time. Using either an imcando or elder rune mattock with all available mattock upgrades and wearing the full archaeologist's outfit , experience rates average around 125,000 experience an hour at these spots, plus any additional experience from handing in pylon batteries. Artefacts from Yu'biusk animal pen Artefact Restore XP Needed From research Collections Other uses Beastkeeper helm 13,333.3 3 N/A Museum - Bandosian II ( Velucia ) Red Rum Relics I ( General Bentnoze ) Hat Problem ( Wise Old Man ) N/A Idithuun horn ring 13,333.3 2 N/A Museum - Bandosian II ( Velucia ) Green Gobbo Goodies II ( General Wartface ) N/A 'Nosorog!' sculpture 13,333.3 2 N/A Museum - Bandosian II ( Velucia ) Red Rum Relics I ( General Bentnoze ) N/A"
    },
    {
        "levels": "95-96",
        "method": "Return to the Stormguard Citadel - Dayguard tower excavation site and excavate Keshik tower debris . Once you have restored one stormguard gerege you can add it to your tool belt and complete the Howl's Floating Workshop mystery and the Back to the Drawing Board special research. This unlocks access to Ancient Invention and the ability to create blueprints using any torn blueprint fragments that you have collected up until this point. This excavation site is very remote. Use of signs of the porter or magic notepaper is recommended. Using either an imcando or elder rune mattock with all available mattock upgrades and wearing the full archaeologist's outfit , experience rates average around 143,000-150,000 experience an hour at these spots. Artefacts from Keshik tower debris Artefact Restore XP Needed From research Collections Other uses Dayguard shield 14,166.7 2 N/A Museum - Armadylean II ( Velucia ) Armadylean II ( Lowse ) N/A Stormguard gerege 14,166.7 3 Night and Day Museum - Armadylean II ( Velucia ) Armadylean II ( Lowse ) Howl's Floating Workshop (tool belt)"
    },
    {
        "levels": "96-97",
        "method": "Return to the Orthen - Crypt of Varanus excavation site and train at the dragonkin reliquary excavation hotspots. You may find more pages for the Crypt o' Zoology mystery here, though these can also be obtained later on. You can also obtain fragments for the Archaeology potion recipe here. Artefacts from Dragonkin reliquary Artefact Restore XP Needed From research Collections Other uses Vazara 15,000 2 N/A Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) N/A Kilaya 15,000 2 N/A Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) N/A"
    },
    {
        "levels": "97-98",
        "method": "Go back to the Warforge - North goblin tunnels and excavate the goblin trainee remains . One of the Ourg megahitters is required to recruit Asgarnia Smith to your research team later on. You can complete the Green Gobbo Goodies II collection with General Wartface for the first time. Using either an imcando or elder rune mattock with all available mattock upgrades and wearing the full archaeologist's outfit , experience rates average around 152,000 experience an hour at these spots. Artefacts from Goblin trainee remains Artefact Restore XP Needed From research Collections Other uses Garagorshuun anchor 15,833.3 3 Northside Museum - Bandosian II ( Velucia ) Green Gobbo Goodies II ( General Wartface ) Green skull cave painting Ourg megahitter 15,833.3 3 Dwarven Forge Museum - Bandosian II ( Velucia ) Red Rum Relics II ( General Bentnoze ) Asgarnia Smith Ourg tower/goblin cower shield 15,833.3 2 N/A Museum - Bandosian II ( Velucia ) Red Rum Relics II ( General Bentnoze ) N/A"
    },
    {
        "levels": "98-99",
        "method": "Go to the Infernal Source - The Harrowing north-west excavation site and excavate Byzroth remains . Artefacts from Byzroth remains Artefact Restore XP Needed From research Collections Other uses Hellfire haladie 16,666.7 2 N/A Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A Hellfire katar 16,666.7 4 Hell Mouths Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) The Rings of Razulei (2 needed) Hellfire zaghnal 16,666.7 2 N/A Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A After you have obtained all the required artefacts from the Infernal Source switch to the Stormguard Citadel - Research & Development south-west excavation site . Excavate the destroyed golem excavation hotspots. One restored set of golem instructions is required to recruit Elissa Giovanni to your research team later on. Complete the Museum - Armadylean II and Armadylean II artefact collections by handing them in to Velucia and Lowse . Artefacts from Destroyed golem Artefact Restore XP Needed From research Collections Other uses Golem heart 16,666.7 3 N/A Museum - Armadylean II ( Velucia ) Armadylean II ( Lowse ) Golem framework Golem instruction 16,666.7 5 The Aetherium Giant Museum - Armadylean II ( Velucia ) Knowledge is Power ( Wise Old Man ) Armadylean II ( Lowse ) Golem framework Elissa Giovanni Using either an imcando or elder rune mattock with all available mattock upgrades and wearing the full archaeologist's outfit , experience rates average around 172,000 experience an hour at these spots. With at least level 99 Archaeology the guildmaster qualification can be unlocked by meeting the achievements listed below and talking to Acting Guildmaster Reiniger : Qualification - Professor ( 50) – Complete all of the listed achievements and attend the qualification ceremony. Archaeology 99 ( 5) – Reach level 99 in the Archaeology skill. Mystery Solver VI ( 40) – Solve 20 of Gielinor's greatest mysteries. Collectors Assemble VII ( 60) – Complete 25 unique collections for archaeological collectors. (X/25) The Discoverer IX ( 50) – Excavate damaged artefacts. (X/1,000) The Restorer IX ( 50) – Restore damaged artefacts. (X/1,000) The Researcher IV ( 20) – Send your research team out on field studies. Tracked in hours. (X/168) However, you are not likely to have found and restored enough artefacts at this point to be able to complete the qualification straight away. You can either opt to continue training and unlock the qualification once you hit the required number of artefacts or return to complete quick collections of artefacts to meet the requirement. Completion of Green Gobbo Goodies II is recommended if you wish to do this. When you have unlocked the guildmaste qualification you can complete the Philosophy and the Writings of the Walls: Kharid-et , Infernal Source , Everlight , Stormguard , and Warforge special research. Completing these will complete the Writings on the Walls mystery. Simon Templeton is automatically unlocked for your research team and Anna Jones , Asgarnia Smith , and Elissa Giovanni can be recruited (a restored ourg megahitter and golem instructions are required for Asgarnia and Elissa). You can now purchase the final base mattock precision upgrade from the Archaeology Guild Shop , as well as the master archaeologist's outfit , and the energised meteorite shard which is used to create the mattock of Time and Space . Five material manuals , five hi-spec monocles , five tarpaulin sheets , and five cups of archaeologist's tea may be claimed from Acting Guildmaster Reiniger by talking to her after completing the qualification."
    },
    {
        "levels": "99-100",
        "method": "Go to the Orthen - Crypt of Varanus excavation site and excavate the dragonkin coffins . You should now have all the artefacts required to complete the Museum - Dragonkin I and Dragonkin I artefact collections. Hand them in to Velucia and Sharrigan . If you have not already completed Crypt o' Zoology mystery then obtain all four of the required pages before moving on, as this is the last spot where they can be obtained. You may also find fragments of the Summoning renewal recipe while training here. Artefacts from Dragonkin coffin Artefact Restore XP Needed From research Collections Other uses Death mask 17,500 3 Breath of Fire Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) Evil Bob's Catspaw Dragonkin calendar 17,500 2 N/A Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) N/A Dragonkin staff 17,500 2 N/A Dragonkin I ( Sharrigan ) Museum - Dragonkin I ( Velucia ) N/A"
    },
    {
        "levels": "100-101",
        "method": "At level 100 return to the Warforge and study Bandos's throne to unlock the Power Behind the Throne special research. Complete the research and excavate the kyzaj champion's boudoir hotspots in the Warforge - South goblin tunnels excavation site . Complete the You Have Chosen... mystery using one restored spear and one restored sculpture. You can also complete the Stick It to Da Boss Man achievement using a restored dorgeshuun spear; the spear is not consumed while completing the achievement. The Museum - Bandosian II collection can be completed for the first time by speaking to Velucia . Artefacts from Kyzaj champion's boudoir Artefact Restore XP Needed From research Collections Other uses Dorgeshuun spear 18,666.7 3 Too Many Bones Museum - Bandosian II ( Velucia ) Green Gobbo Goodies III ( General Wartface ) Stick It to Da Boss Man (not consumed) You Have Chosen... 'Forged in War' sculpture 18,666.7 3 Power Behind the Throne Museum - Bandosian II ( Velucia ) Red Rum Relics II ( General Bentnoze ) You Have Chosen... After you have completed everything at the Warforge head to the Everlight - Dominion Games stadium excavation site and excavate from the icyene weapon racks . Complete the Museum - Saradominist III and Saradominist III collections for the first times by speaking to Velucia and Sir Atcha . Artefacts from Icyene weapon rack Artefact Restore XP Needed From research Collections Other uses Kopis dagger 18,666.7 2 N/A Museum - Saradominist III ( Velucia ) Saradominist III ( Sir Atcha ) N/A Xiphos short sword 18,666.7 2 N/A Museum - Saradominist III ( Velucia ) Saradominist III ( Sir Atcha ) N/A Finally, go to the Kharid-et - Culinarum excavation site 's culinarum debris hotspots. One restored spell scroll should be saved to complete the Vault of Shadows quest. Artefacts from Culinarum debris Artefact Restore XP Needed From research Collections Other uses 'Smoke Cloud' spell scroll 18,666.7 5 Where There's Smoke... Museum - Zarosian III ( Velucia ) Magic Man ( Wise Old Man ) Zarosian III ( Soran, Emissary of Zaros ) Imperial Sorcery ( Eblis ) The Vault of Shadows Vigorem vial 18,666.7 2 N/A Museum - Zarosian III ( Velucia ) Zarosian III ( Soran, Emissary of Zaros ) N/A Using a mattock of Time and Space with all available mattock upgrades and wearing the full master archaeologist's outfit experience rates average around 183,000 experience an hour at these spots. Additional experience is gained at the Kharid-et site from obtaining and handing in pylon batteries."
    },
    {
        "levels": "101-102",
        "method": "Head to the Orthen - Observation outpost excavation site and excavate the autopsy tables . If you have not already, complete the Incomplete Portal Network I special research and repair the orthen teleportation device at the outpost. This requires level 70 Runecrafting and 20 un-noted ancient vis . These hotspots may give pieces of the Summoning renewal recipe . Artefacts from Autopsy table Artefact Restore XP Needed From research Collections Other uses Dragon scalpel 19,833.3 3 Necropsy Dragonkin II ( Sharrigan ) Museum - Dragonkin II ( Velucia ) Artificer's measure Protective goggles 19,833.3 3 N/A Dragonkin II ( Sharrigan ) Museum - Dragonkin II ( Velucia ) Artificer's measure"
    },
    {
        "levels": "102-103",
        "method": "At level 102 move to the experiment workbenches . The workbench hotspots may drop fragments of the holy aggroverload recipe . Before moving on complete the Death Watch mystery by finding the four pages from the two types of site in the outpost excavation site. You can also complete the Dragonkin II and Museum - Dragonkin II collections for the first time by handing in artefacts to Sharrigan and Velucia . Artefacts from Experiment workbench Artefact Restore XP Needed From research Collections Other uses Dragon burner 21,000 6 N/A Dragonkin II ( Sharrigan ) Museum - Dragonkin II ( Velucia ) Orthen furnace core (4 needed) Orthenglass flask 21,000 4 N/A Dragonkin II ( Sharrigan ) Museum - Dragonkin II ( Velucia ) Soma Artificer's measure"
    },
    {
        "levels": "103-104",
        "method": "Return to the Stormguard Citadel - Nightguard tower excavation site and excavate the keshik weapon racks . Artefacts from Keshik weapon rack Artefact Restore XP Needed From research Collections Other uses Blackfire lance 22,166.7 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A Nightguard shield 22,166.7 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A After the requireed artefacts from the keshik weapon racks have been obtained and restored, players with level 95 Dungeoneering can go to the Daemonheim - Castle excavation site . Unlock and complete the On the Threshold of the Mind special research mission. You can then enter the imposing door to the Daemonheim - Depths excavation site . Excavate the projection spaces . You may uncover a strange token while excavating here. If you do, the mystery A New Age can be completed. Artefacts from Projection space Artefact Restore XP Needed From research Collections Other uses Projection attuner 22,166.7 2 N/A Dragonkin VII ( Sharrigan ) Museum - Dragonkin VII ( Velucia ) N/A Golden projection 'needle' 22,166.7 2 N/A Dragonkin VII ( Sharrigan ) Museum - Dragonkin VII ( Velucia ) N/A"
    },
    {
        "levels": "104-105",
        "method": "At the Warforge - North goblin tunnels site excavate from the Warforge scrap piles . Artefacts from Warforge scrap pile Artefact Restore XP Needed From research Collections Other uses Huzamogaarb chaos crown 23,333.3 3 N/A Museum - Bandosian III ( Velucia ) Hat Problem ( Wise Old Man ) Green Gobbo Goodies III ( General Wartface ) N/A Saragorgak star crown 23,333.3 3 N/A Museum - Bandosian III ( Velucia ) Hat Hoarder ( Wise Old Man ) Green Gobbo Goodies III ( General Wartface ) N/A Go to the Infernal Source - The Harrowing north-east excavation site site and excavate the hellfire forges excavation hotspots. Complete the Zamorakian III and Museum - Zamorakian III collections for the first time. This site is recommended over the Warforge scrap piles as the artefacts obtained there require materials only obtainable from other digsites. Experience rates at this level are around 210,000 experience an hour, with bonuses. Artefacts from Hellfire forge Artefact Restore XP Needed From research Collections Other uses 'Possession' metal sculpture 23,333.3 2 N/A Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A Trishula 23,333.3 2 N/A Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A Tsutsaroth piercing 23,333.3 2 N/A Museum - Zamorakian III ( Velucia ) Zamorakian III ( Isaura ) N/A"
    },
    {
        "levels": "105-106",
        "method": "Excavate the stockpiled art hotspots at the Everlight - Underwater cave excavation site . If you have not already done so you will need to progress the Hallowed Be... mystery up until the point where you access the underwater cave to the excavation site. While excavating here you will commonly obtain mosaic pieces . When you have 300 you can complete the Hallowed Be... mystery. A restored 'Hallowed Be the Everlight' painting is also required during the mystery, but it is not consumed. You can complete the Radiant Renaissance artefact collection for the first time. With level 105 Archaeology you can create a lit hallowed lantern and use it on the repaired Statue of Hebe to gain 'The Epic of Hebe' reward book. This can be read to receive 50,000 Archaeology experience. Artefacts from Stockpiled art Artefact Restore XP Needed From research Collections Other uses 'The Pride of Padosan' painting 24,500 3 N/A Radiant Renaissance ( Art Critic Jacques ) Museum - Saradominist IV ( Velucia ) Saradominist IV ( Sir Atcha ) N/A 'Hallowed Be the Everlight' painting 24,500 3 Battle of Optimatoi Radiant Renaissance ( Art Critic Jacques ) Museum - Saradominist IV ( Velucia ) Saradominist IV ( Sir Atcha ) Hallowed Be... (not consumed) 'The Lord of Light' painting 24,500 3 N/A Radiant Renaissance ( Art Critic Jacques ) Museum - Saradominist IV ( Velucia ) Saradominist IV ( Sir Atcha ) N/A"
    },
    {
        "levels": "106-107",
        "method": "At level 106 you should complete the Incomplete Portal Network II special research, if you have not already done so, and complete the Know Thy Measure mystery to unlock access to the Moksha ritual site . Repair the Orthen teleportation device outside the ritual site using 20 un-noted orthenglass . Enter the Orthen - Moksha ritual site excavation site and excavate the aughra remains . While excavating here you may find the four pages required to complete the Free Your Mind mystery. Artefacts from Aughra remains Artefact Restore XP Needed From research Collections Other uses Meditation pipe 25,666.7 2 N/A Dragonkin III ( Sharrigan ) Museum - Dragonkin III ( Velucia ) N/A Singing bowl 25,666.7 2 N/A Dragonkin III ( Sharrigan ) Museum - Dragonkin III ( Velucia ) Fragmented Memories (not consumed) Personal totem 25,666.7 2 N/A Dragonkin III ( Sharrigan ) Museum - Dragonkin III ( Velucia ) N/A"
    },
    {
        "levels": "107-108",
        "method": "First, return to the Daemonheim - Depths excavation site and excavate the security booths . You should get the chunk of primal alloy before moving on, as it can only be obtained at this excavation hotspot and is required to complete A New Form . You may uncover a strange token while excavating here. If you do, the mystery A New Age can be completed. Artefacts from Security booth Artefact Restore XP Needed From research Collections Other uses Comfort gatestone 27,000 2 N/A Dragonkin VII ( Sharrigan ) Museum - Dragonkin VII ( Velucia ) N/A Halak's cube 27,000 2 N/A Dragonkin VII ( Sharrigan ) Museum - Dragonkin VII ( Velucia ) N/A Next move to the Kharid-et - Praetorium excavation site and excavate ancient magick munitions hotspots. One of the spell scrolls is required for The Vault of Shadows quest and mystery. You can start to find the six pages from the commander's log, for the Decimation mystery, and the five pages from the Praetorian's log, for the Shadow Fall mystery at this hotspot. You will also have all the restored artefacts required to complete the Museum - Zarosian III , Zarosian III , and Imperial Sorcery collections for the first time. Artefacts from Ancient magick munitions Artefact Restore XP Needed From research Collections Other uses Ancient magic tablet 27,000 3 N/A Museum - Zarosian III ( Velucia ) Zarosian III ( Soran, Emissary of Zaros ) Imperial Sorcery ( Eblis ) N/A Portable phylactery 27,000 4 N/A Museum - Zarosian III ( Velucia ) Magic Man ( Wise Old Man ) Zarosian III ( Soran, Emissary of Zaros ) The Forgotten Prisoner 'Animate Dead' spell scroll 27,000 5 Shadow Play Museum - Zarosian III ( Velucia ) Magic Man ( Wise Old Man ) Zarosian III ( Soran, Emissary of Zaros ) Imperial Sorcery ( Eblis ) The Vault of Shadows"
    },
    {
        "levels": "108-109",
        "method": "Return to the Orthen - Moksha ritual site excavation site and excavate moksha devices . Complete the Fragmented Memories mystery using a restored lingam stone and master control to gain access to Xolo City . You can also complete the Dragonkin III and Museum - Dragonkin III artefact collections for the first time. Artefacts from Moksha device Artefact Restore XP Needed From research Collections Other uses Lingam stone 28,333.3 3 N/A Dragonkin III ( Sharrigan ) Museum - Dragonkin III ( Velucia ) Access to Xolo City Master control 28,333.3 3 Mind Your Head Dragonkin III ( Sharrigan ) Museum - Dragonkin III ( Velucia ) Fragmented Memories"
    },
    {
        "levels": "109-110",
        "method": "Go to the bibliotheke debris at the Everlight - Acropolis excavation site . Artefacts from Bibliotheke debris Artefact Restore XP Needed From research Collections Other uses 'The Enlightened Soul' scroll 29,666.7 3 N/A Museum - Saradominist IV ( Velucia ) Knowledge is Power ( Wise Old Man ) Saradominist IV ( Sir Atcha ) N/A 'The Eudoxian Elements' tablet 29,666.7 3 N/A Museum - Saradominist IV ( Velucia ) Knowledge is Power ( Wise Old Man ) Saradominist IV ( Sir Atcha ) N/A"
    },
    {
        "levels": "110-111",
        "method": "First go to the Infernal Source - Dagon Overlook north excavation site and excavate the chthonian trophies . Artefacts from Chthonian trophies Artefact Restore XP Needed From research Collections Other uses Chaos Elemental trophy 31,000 2 N/A Museum - Zamorakian IV ( Velucia ) Zamorakian IV ( Isaura ) N/A Virius trophy 31,000 2 N/A Museum - Zamorakian IV ( Velucia ) Zamorakian IV ( Isaura ) N/A For the rest of the level go to the Warforge weapon racks at the Warforge - Thalmund's forge excavation site . Complete the Red Rum Relics II collection for the first time by handing in artefacts to General Bentnoze . You may find the five pages required to complete the Heart of the Forge mystery at this spot. Artefacts from Warforge weapon rack Artefact Restore XP Needed From research Collections Other uses Drogokishuun hook sword 31,000 2 N/A Museum - Bandosian III ( Velucia ) Green Gobbo Goodies III ( General Wartface ) N/A Hobgoblin mansticker 31,000 2 N/A Museum - Bandosian III ( Velucia ) Red Rum Relics II ( General Bentnoze ) N/A"
    },
    {
        "levels": "111-112",
        "method": "Go to the Stormguard Citadel - Research & Development south-east excavation site . Excavate from the flight research debris . Artefacts from Flight research debris Artefact Restore XP Needed From research Collections Other uses Flat cap 32,333.3 3 N/A Museum - Armadylean III ( Velucia ) Hat Problem ( Wise Old Man ) Armadylean III ( Lowse ) N/A Night owl flight goggles 32,333.3 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A"
    },
    {
        "levels": "112-113",
        "method": "At level 112 move to the Stormguard Citadel - Howl's workshop excavation site and excavate from the aetherium forges . A damaged prototype godsword is used in the That's Not How it Works achievement, but is not consumed. Artefacts from Aetherium forge Artefact Restore XP Needed From research Collections Other uses Prototype godbow 33,666.7 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A Prototype godsword 33,666.7 3 Back to the Drawing Board Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) That's Not How it Works (damaged, not consumed) The Subtle Blade Prototype godstaff 33,666.7 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A"
    },
    {
        "levels": "113-114",
        "method": "At the level 113 you will start training at the Orthen - Xolo city excavation site for the first time. You will need to complete the Fragmented Memories mystery to enter the site if you have not done so previously. Complete the Incomplete Portal Network III special research and restore the Orthen teleportation device outside Xolo City using 20 un-noted quintessence . You should now have restored all the teleportation devices, which completes the Teleport Node On mystery. At Xolo City excavate from the xolo mines . You can start to find the four pages required to complete the I Am Become Death mystery at this site, as well as fragments of the powerburst of opportunity recipe. Artefacts from Xolo mine Artefact Restore XP Needed From research Collections Other uses Xolo hard hat 35,000 2 N/A Dragonkin IV ( Sharrigan ) Museum - Dragonkin IV ( Velucia ) N/A Xolo pickaxe 35,000 2 N/A Dragonkin IV ( Sharrigan ) Museum - Dragonkin IV ( Velucia ) N/A After this complete the Thought Process special research to unlock the Daemonheim - Depths excavation site . Train at the traveller's stations . Complete the Dragonkin VII and Museum - Dragonkin VII artefact collections. The cracked totem and mangled trinket required to complete A New Form mystery can only be excavated from this hotspot, after obtaining them the mystery can be completed. These are the final hotspots where the strange token can be found so obtain it and complete the A New Age mystery before moving on. Artefacts from Traveller's station Artefact Restore XP Needed From research Collections Other uses Portable portal generator 35,000 2 N/A Dragonkin VII ( Sharrigan ) Museum - Dragonkin VII ( Velucia ) N/A Warped trinket 35,000 2 N/A Dragonkin VII ( Sharrigan ) Museum - Dragonkin VII ( Velucia ) N/A"
    },
    {
        "levels": "114-115",
        "method": "Return to the Kharid-et - Praetorium excavation site and excavate the praetorian remains . One of the staves is required if creating your own inquisitor staff . Pages for the commander's log and praetorian's log can be obtained here. You can complete the Hat Problem collection for the first time by handing in artefacts to the Wise Old Man . Artefacts from Praetorian remains Artefact Restore XP Needed From research Collections Other uses Praetorian hood 36,666.7 3 N/A Museum - Zarosian IV ( Velucia ) Hat Problem ( Wise Old Man ) Zarosian IV ( Soran, Emissary of Zaros ) N/A Praetorian robes 36,666.7 2 N/A Museum - Zarosian IV ( Velucia ) Zarosian IV ( Soran, Emissary of Zaros ) N/A Praetorian staff 36,666.7 3 N/A Museum - Zarosian IV ( Velucia ) Zarosian IV ( Soran, Emissary of Zaros ) Inquisitor staff"
    },
    {
        "levels": "115-116",
        "method": "Go to the Bandos's sanctum debris excavation spots at the Warforge - Bandos's sanctum excavation site . Artefacts from Bandos's sanctum debris Artefact Restore XP Needed From research Collections Other uses Kal-i-kra chieftain crown 38,333.3 3 N/A Museum - Bandosian III ( Velucia ) Red Rum Relics III ( General Bentnoze ) Hat Hoarder ( Wise Old Man ) N/A Kal-i-kra mace 38,333.3 2 N/A Museum - Bandosian III ( Velucia ) Red Rum Relics III ( General Bentnoze ) N/A Kal-i-kra warhorn 38,333.3 2 N/A Museum - Bandosian III ( Velucia ) Red Rum Relics III ( General Bentnoze ) N/A"
    },
    {
        "levels": "116-117",
        "method": "Go to the Infernal Source - Dagon Overlook south-west excavation site and excavate Tsutsaroth remains . You can now complete the Zamorakian IV , Museum - Zamorakian IV , and Hat Hoarder collections. Artefacts from Tsutsaroth remains Artefact Restore XP Needed From research Collections Other uses Tsutsaroth helm 40,000 3 N/A Museum - Zamorakian IV ( Velucia ) Hat Hoarder ( Wise Old Man ) Zamorakian IV ( Isaura ) N/A Tsutsaroth pauldron 40,000 2 N/A Museum - Zamorakian IV ( Velucia ) Zamorakian IV ( Isaura ) N/A Tsutsaroth urumi 40,000 2 N/A Museum - Zamorakian IV ( Velucia ) Zamorakian IV ( Isaura ) N/A"
    },
    {
        "levels": "117-118",
        "method": "Train at the optimatoi remains in the Everlight - Underwater cave excavation site . The Saradominist IV and Museum - Saradominist IV collections can be completed for the first time by handing in artefacts to Sir Atcha and Velucia . Artefacts from Optimatoi remains Artefact Restore XP Needed From research Collections Other uses Kontos lance 41,666.7 2 N/A Museum - Saradominist IV ( Velucia ) Saradominist IV ( Sir Atcha ) N/A Doru spear 41,666.7 2 N/A Museum - Saradominist IV ( Velucia ) Saradominist IV ( Sir Atcha ) N/A"
    },
    {
        "levels": "118-119",
        "method": "First return to Stormguard Citadel - Howl's workshop excavation site and train at Howl's workshop debris . The Armadylean III , Museum - Armadylean III , and Magic Man collections can be completed for the first time. Artefacts from Howl's workshop debris Artefact Restore XP Needed From research Collections Other uses Chuluu stone 43,333.3 4 Howling Man Museum - Armadylean III ( Velucia ) Magic Man ( Wise Old Man ) Armadylean III ( Lowse ) Experimental Aether Reactor Quintessence counter 43,333.3 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A Spherical astrolabe 43,333.3 2 N/A Museum - Armadylean III ( Velucia ) Armadylean III ( Lowse ) N/A After obtaining the artefacts from the workshop debris switch to war table debris at the Kharid-et - Praetorium excavation site . Complete the Zarosian IV , Museum - Zarosian IV , and Imperial Impressionism collections. This is the last hotspot where the six commander's log and five praetorian's log pages can be obtained, so get them and complete the Decimation and Shadow Fall mysteries if you have not already done so before continuing. Artefacts from War table debris Artefact Restore XP Needed From research Collections Other uses Ancient globe 43,333.3 2 N/A Museum - Zarosian IV ( Velucia ) Zarosian IV ( Soran, Emissary of Zaros ) N/A Battle plans 43,333.3 2 N/A Museum - Zarosian IV ( Velucia ) Zarosian IV ( Soran, Emissary of Zaros ) N/A 'Prima Legio' painting 43,333.3 3 N/A Museum - Zarosian IV ( Velucia ) Imperial Impressionism ( Art Critic Jacques ) Zarosian IV ( Soran, Emissary of Zaros ) N/A"
    },
    {
        "levels": "119-120",
        "method": "Start by going to the Orthen - Xolo city excavation site and obtaining the required artefacts from the Xolo remains . Artefacts from Xolo remains Artefact Restore XP Needed From research Collections Other uses Xolo shield 45,000 2 N/A Dragonkin IV ( Sharrigan ) Museum - Dragonkin IV ( Velucia ) N/A Xolo spear 45,000 2 N/A Dragonkin IV ( Sharrigan ) Museum - Dragonkin IV ( Velucia ) N/A Next go to the makeshift pie oven hotspots in the Warforge - Thalmund's forge excavation site . You can complete the Museum - Bandosian III collection, with Velucia ; Green Gobbo Goodies III collection, with General Wartface ; Red Rum Relics III collection, with General Bentnoze ; and Knowledge is Power collection, with the Wise Old Man . Artefacts from Makeshift pie oven Artefact Restore XP Needed From research Collections Other uses Horogothgar cooking pot 45,000 2 N/A Museum - Bandosian III ( Velucia ) Green Gobbo Goodies III ( General Wartface ) N/A 'Da Boss Man' sculpture 45,000 4 Big High War Chest Museum - Bandosian III ( Velucia ) Red Rum Relics III ( General Bentnoze ) Knowledge is Power ( Wise Old Man ) Green Gobbo Goodies III ( General Wartface ) N/A"
    },
    {
        "levels": "120+",
        "method": "Continue training at the Orthen - Xolo city excavation site . The saurthen debris is the highest level excavation site available. One of each artefact is required to complete the Mysterious City mystery. The final two artefact collections, Dragonkin IV and Museum - Dragonkin IV , can be completed by handing in artefacts to Sharrigan and Velucia . If you have not already completed I Am Become Death the four pages required to solve the mystery can be obtained here. Artefacts from Saurthen debris Artefact Restore XP Needed From research Collections Other uses Gold dish 46,666.7 3 N/A Dragonkin IV ( Sharrigan ) Museum - Dragonkin IV ( Velucia ) Mysterious City 'Raksha' idol 46,666.7 3 Xolo Dorado Dragonkin IV ( Sharrigan ) Museum - Dragonkin IV ( Velucia ) Mysterious City"
    }
]