[
    {
        "title": "Overview",
        "content": [
            "Slayer is a combat skill where Slayer masters assign you specific monsters to kill. It provides access to high-value monster drops, unique Slayer equipment, and a steady source of combat XP. P2P players have access to all Slayer masters and the full range of high-level tasks.",
            "The general strategy is to use the highest-tier master available to you, block bad tasks, extend profitable ones, and push through tasks as efficiently as possible."
        ]
    },
    {
        "title": "Choosing Your Slayer Master",
        "content": [
            "Always use the highest-tier Slayer master your combat level allows. Higher masters assign better tasks with more Slayer XP and valuable drops.",
            "- Turael (Burthorpe): Combat level 3 — use only for skipping unwanted tasks from other masters",
            "- Mazchna (Morytania): Combat level 20 — early game tasks",
            "- Vannaka (Edgeville Dungeon): Combat level 40",
            "- Chaeldar (Lost City): Combat level 75 — requires Lost City quest",
            "- Sumona (Pollnivneach): Combat level 90 — requires Smoking Kills",
            "- Kuradal (Ancient Cavern): Combat level 110 — recommended from 110+; dungeon monsters give bonus XP",
            "- Morvran (Prifddinas): Combat level 120 — best assignment table; requires Plague's End"
        ]
    },
    {
        "title": "Points Management",
        "content": [
            "Earn Slayer points by completing tasks (bonus points every 10th, 50th, 100th, 250th, and 1000th task). Prioritise your spending wisely.",
            "Key point unlocks for P2P players:",
            "- Broader Fletching: Craft broad bolts — very useful for Fletching skill training",
            "- Slayer Helmet upgrades: Purchase Hexcrest and Focus Sight for the full helmet",
            "- Block list: Block weak tasks (Desert Lizards, Cave Bugs, Banshees) to avoid wasting time",
            "- Extend list: Extend high-value tasks (Abyssal Demons, Gargoyles, Nechryaels)",
            "- Turael skip: Skip one bad task per visit to Turael at the cost of resetting your task streak"
        ]
    },
    {
        "title": "Recommended High-Value Tasks",
        "content": [
            "The most efficient and rewarding Slayer tasks for P2P players:",
            "- Abyssal Demons (85 Slayer): Abyssal whip, orb, wand — valuable items on the GE",
            "- Gargoyles (75 Slayer): Consistent drops of herbs, ores, gems, and granite maul",
            "- Nechryaels (80 Slayer): Excellent herb drops; good XP rate",
            "- Spiritual Mages (83 Slayer): Dragon boots — high value on the Grand Exchange",
            "- Dark Beasts (90 Slayer): Dark bow, death talisman drops",
            "- Glacors (96 Slayer): Glacyte boots, armadyl battlestaff components",
            "- Airuts (92 Slayer): High combat XP, good charm drop rates",
            "- Automatons (67 Slayer): Valuable glove drops (Pneumatic, Tracking, Sparkling)"
        ]
    },
    {
        "title": "Boss Slayer Tasks",
        "content": [
            "Assigning bosses as Slayer tasks (purchased with Slayer points) gives bonus Slayer XP on top of boss loot. Highly recommended for experienced players.",
            "- GWD1 Bosses (Bandos, Armadyl, etc.): Standard mid-game boss tasks",
            "- Araxxor/Araxxi (92 Slayer): Noxious weapons components and spider web drops",
            "- The Magister (115 Slayer): Khopeshes and Port Gwaenith materials",
            "- Kalphite King: Drygore weapons; one of the strongest mid-game boss tasks",
            "- Telos, the Warden (80+ enrage): Planted Feet perk, anima core equipment",
            "Boss tasks provide the best Slayer XP per hour at endgame alongside valuable unique drops."
        ]
    },
    {
        "title": "Slayer Codex and Sunken Pyramid",
        "content": [
            "Players with at least level 99 Slayer can fill their Slayer Codex. For every 20 souls collected, Slayer helmets grant a +1% Slayer XP gain bonus (up to 5% at 100 souls). Investing time to reach 100 souls is worthwhile for long-term gains.",
            "Players with level 99 Slayer also gain access to the Sunken Pyramid, a personal dungeon where you can assign specific Slayer rooms and optimise task completion in a controlled environment."
        ]
    },
    {
        "title": "Useful Items",
        "content": [
            "- Full Slayer Helmet: +15% melee and +12.5% range/magic damage while on task; combine all components",
            "- Herbicide: Auto-destroys herbs for passive Herblore XP during tasks",
            "- Bonecrusher: Auto-buries bones; pair with Demon horn necklace for Prayer restoration",
            "- Aggression potion: Forces nearby monsters to attack you — enables AFK Slayer",
            "- Slayer Cape: Teleport to any Slayer master for free once at 99",
            "- Ferocious ring: Teleport to Kuradal's Dungeon; +4 strength bonus while in the dungeon"
        ]
    }
]
