[
    {
        "title": "Overview",
        "content": [
            "Cooking is one of the fastest skills to train in RuneScape 3. P2P players have access to Portable ranges, which give a 5% XP bonus and reduce burn chance significantly. The Cooking cape eliminates burn chance entirely for most fish once equipped.",
            "The most efficient setup is using a Portable range placed next to a bank or bank chest, buying raw fish from the Grand Exchange, cooking in bulk, and dropping or banking the cooked product."
        ]
    },
    {
        "title": "Levels 1-30: Basic Meats and Trout",
        "content": [
            "At very low levels, cook basic meats to build up XP quickly. These are cheap and widely available.",
            "- Levels 1-10: Raw beef or raw chicken (30 XP each) — kill cows or chickens nearby or buy from GE",
            "- Levels 10-20: Trout (70 XP each) — buyable from the Grand Exchange cheaply",
            "- Levels 20-30: Salmon (90 XP each) — a slight upgrade over trout"
        ]
    },
    {
        "title": "Levels 30-68: Salmon and Lobsters",
        "content": [
            "Salmon and lobsters are the standard mid-level Cooking training fish. Both are cheap and widely available on the Grand Exchange.",
            "- Levels 30-50: Salmon (90 XP each)",
            "- Levels 50-68: Lobsters (120 XP each) — very common, low cost",
            "Use a Portable range for a 5% XP bonus. A bank chest nearby (e.g., at the Cooking Guild) makes this highly efficient."
        ]
    },
    {
        "title": "Levels 68-90: Monkfish and Sharks",
        "content": [
            "From level 68 onwards, higher-tier fish provide better XP rates.",
            "- Levels 68-80: Monkfish (150 XP each) — accessible P2P fish, moderate cost",
            "- Levels 80-90: Sharks (210 XP each) — high XP per fish, widely available",
            "With a Portable range and fast banking, expect 300,000–400,000 XP/hour at this stage."
        ]
    },
    {
        "title": "Levels 90-99/120: Rocktails and Sailfish",
        "content": [
            "Rocktails and Sailfish are the top-tier cooking targets. Sailfish provides the highest Cooking XP per action in the game.",
            "- Levels 90-99: Rocktails (225 XP each) or Sailfish (270 XP each)",
            "- Levels 99-120: Sailfish (270 XP each) — peak XP rate of 400,000–500,000 XP/hour with portables and all bonuses",
            "The Cooking cape eliminates burn chance for all standard fish once worn, making burn-free cooking trivial."
        ]
    },
    {
        "title": "Boosts and Tips",
        "content": [
            "Several bonuses stack to greatly increase Cooking XP rates:",
            "- Portable ranges: 5% XP bonus, reduced burn chance; obtain from Treasure Hunter or other players",
            "- Cooking gauntlets: Drastically reduce burn rate for lobsters, swordfish, monkfish, sharks, rocktails, and sailfish",
            "- Modified sous chef's outfit: Up to 6% bonus XP from the full set",
            "- Pulse cores: 10% bonus XP for a limited time; very effective during high-rate cooking",
            "- Double XP events: Greatly reduce the fish needed; stock up on raw fish before events"
        ]
    }
]
