[
    {
        "title": "Overview",
        "content": [
            "Firemaking is a buyable skill for P2P players but ironmen must source all logs themselves through Woodcutting or passive income methods. The key ironman strategy is to align Firemaking progression with Woodcutting — cut logs and burn them as you go rather than stockpiling.",
            "Managing Miscellania is a critical passive income source from mid-levels. Set your kingdom to collect Maples or Mahogany for a steady supply of logs without active Woodcutting. From level 83, Curly Roots in the Jadinko Lair become the best method — simultaneous Woodcutting and Firemaking XP with no resource input required."
        ]
    },
    {
        "title": "Levels 1–45: Early Log Burning",
        "content": [
            "Cut and burn logs in parallel with your Woodcutting training. All early wood types can be burned on a bonfire — starting a bonfire and adding logs is more XP-efficient than dropping a line of fires, and you benefit from a group XP bonus if other players join.",
            "- Levels 1–15: Normal logs (40 XP each) — cut from any tree, or purchase from the Fort Forinthry Construction Supplies for a small coin cost.",
            "- Levels 15–30: Oak logs (60 XP each) — plentiful around Lumbridge and Draynor. Cut and burn at a nearby bonfire.",
            "- Levels 30–35: Willow logs (90 XP each) — Draynor Village riverbank has a dense cluster of willow trees.",
            "- Levels 35–45: Teak logs (105 XP each) — Tai Bwo Wannai jungle and Castle Wars area. Managing Miscellania can also supply teaks passively once unlocked."
        ]
    },
    {
        "title": "Levels 45–75: Maple and Mahogany",
        "content": [
            "Maple and mahogany logs are the core ironman mid-level burning material. Both can be collected passively from Managing Miscellania, reducing the need for active Woodcutting during this phase.",
            "- Levels 45–75: Maple logs (135 XP each) — Seers' Village maple trees or Miscellania kingdom (set kingdom to Maples). The Daemonheim Peninsula resource dungeon also has dense maples for active cutting.",
            "- Levels 50–75: Mahogany logs (157.5 XP each) — Miscellania kingdom (set to Mahogany) or cut in Tai Bwo Wannai or Ape Atoll. Slightly better XP than maples but the same level range.",
            "- Levels 75–82: Magic logs (303.8 XP each) — require level 75 Woodcutting. Also obtainable from boss drops (Croesus, Nex, Wilderness Flash Events). Magic logs are valuable for Fletching and Construction, so consider whether burning them or saving them is more efficient for your current goals."
        ]
    },
    {
        "title": "Levels 83–110: Curly Roots (Recommended)",
        "content": [
            "Curly Roots in the Jadinko Lair are the best ironman Firemaking method and remain viable all the way to level 110. They require 83 Woodcutting and 83 Firemaking to access, and provide simultaneous XP in both skills with no resource input — you chop curly jade roots from the ceiling and burn them in the nearby firepits.",
            "XP rates at 83 with Nature's Sentinel outfit and Ring of Fire:",
            "- ~250,000 Firemaking XP/hr",
            "- ~70,000 Woodcutting XP/hr",
            "- ~1,100 Jadinko favour/hr (useful for Herblore secondaries)",
            "At higher levels with full Nature's Sentinel, Ring of Fire, and Flame Gloves: ~305,000 Firemaking XP/hr and ~90,000 Woodcutting XP/hr. This method is semi-AFK and provides consistent dual-skill XP with no supply cost — it is the ironman Firemaking method of choice."
        ]
    },
    {
        "title": "Levels 83–110: Curly Roots Superheat Form (Endgame)",
        "content": [
            "Once you have unlocked Superheat Form (via the Lunar spellbook) or the Always Adze relic power (via the Archaeology Anachronia base camp), it is worth switching away from the Nature's Sentinel outfit in favour of Flame Gloves and Ring of Fire for maximum Firemaking XP at the Jadinko Lair.",
            "With Superheat Form or Always Adze active, Flame Gloves, and Ring of Fire:",
            "- ~670,000 Firemaking XP/hr",
            "- ~120,000 Woodcutting XP/hr",
            "- No Jadinko favour (the outfit bonus is lost when switching to gloves)",
            "This is one of the highest Firemaking XP rates in the game and is fully ironman-achievable. Note that Superheat Form requires access to the Lunar spellbook and the Superglass Make unlockable, while the Always Adze relic requires significant Archaeology progress."
        ]
    },
    {
        "title": "Useful Items and Tips",
        "content": [
            "- Inferno Adze (unlocked from the Firemaking Shattered Worlds reward shop or similar): automatically burns some logs while Woodcutting, passively gaining Firemaking XP during tree cutting.",
            "- Ring of Fire + Flame Gloves: acquired from the All Fired Up beacon minigame (light all 14 beacons simultaneously). Together they provide a 2% XP boost each to Firemaking.",
            "- Pyre logs: burn specific logs at the funeral pyres in Shades of Mort'ton for bonus XP and Shade keys — a slow but useful method if you are completing the Mort'ton area.",
            "- Bonfire group bonus: other players joining your bonfire grant up to ~10% bonus Firemaking XP. Use popular bonfire spots like Edgeville, Burthorpe, or Prifddinas when training on logs.",
            "- Portable brazier (if obtainable from Travelling Merchant): provides a 10% XP boost and works as a personal bonfire — useful during Double XP events if you obtain one."
        ]
    }
]
