[
    {
        "title": "Levels 1-10: Copper/Tin",
        "content": [
            "Mine Copper ore and Tin Ore from Burthorpe 's mining cave, dumping ore at the furnace outside."
        ]
    },
    {
        "title": "Levels 10-20: Iron",
        "content": [
            "Mine Iron ore at the Lumbridge south-west mine , dumping ore at the Shattered Worlds Banker."
        ]
    },
    {
        "title": "Levels 20-30: Coal",
        "content": [
            "Mine Coal at the Lumbridge south-west mine , dumping ore at the Shattered Worlds Banker. Switch to Iron Ore occasionally if you haven't achieved 30 Smithing."
        ]
    },
    {
        "title": "Levels 30-40: Mithril",
        "content": [
            "Mine Mithril ore at the Varrock south-east mine , dumping ore at East Varrock Bank. Switch to Coal occasionally if you haven't achieved 40 Smithing."
        ]
    },
    {
        "title": "Levels 40-50: Adamantite/Luminite",
        "content": [
            "Mine adamantite ore at the Rimmington mine , banking at the Crafting Guild (requires 40 Crafting) or the Grand Exchange via clan vexillum (go back from Port Sarim lodestone ). Switch to luminite occasionally if you haven't achieved 50 Smithing."
        ]
    },
    {
        "title": "Levels 50-70: Runite",
        "content": [
            "Mine Runite ore at the Fight Arena South-east mine , dumping ore at Yanille Bank. Switch back to Luminite occasionally if you haven't achieved 60 Smithing. Acquire enough Orikalkite/Drakolith for an ore box and pickaxe upgrade then go back to runite/luminite. T50 ores and bars are more efficient for mining and smithing combined."
        ]
    },
    {
        "title": "Levels 70-75: Runite",
        "content": [
            "Optionally, keep mining and smithing runite until 75 to unlock crits on Necrite and Phasmatite"
        ]
    },
    {
        "title": "Levels 70/75-81: Phasmatite/Necrite",
        "content": [
            "Mine Phasmatite in the Dwarven Mine resource dungeon (requires 15 and the Hard Daemonheim achievements ) and use the nearby deposit box or at the Port Phasmatys south mine using War's portal to Araxxor (or Ectophial with 92 Agility). Alternate with Necrite Ore in the Al Kharid resource dungeon , accessed with a Mystical sand seed , until you achieved 80 Smithing."
        ]
    },
    {
        "title": "Levels 81-89: Banite",
        "content": [
            "Mine Banite ore at Pirates' Hideout in the Wilderness. It's possible to deposit ore at a forge or anvil right next to the rocks. Alternately, mine at the Arctic (azure) habitat mine , banking with a teleport of choice."
        ]
    },
    {
        "title": "Levels 90-97: Light/Dark animica",
        "content": [
            "Mine Light and Dark animica at Prifddinas during the Trahaearn District Voice of Seren . Levels 97-100 - Mine alaea crablets found in Uncharted Isles if you have already achieved 100 Smithing."
        ]
    },
    {
        "title": "Levels 100-110+: Primal rocks",
        "content": [
            "Mine primal ores around Daemonheim"
        ]
    },
    {
        "title": "Levels 1-99",
        "content": [
            "can be achieved from the Shooting Star D&D, utilising urns to speed up the process. Grants up to 50,002 coins, 52 astral runes, 152 cosmic runes, and 20 gold stone spirits per day."
        ]
    },
    {
        "title": "Levels 60-70",
        "content": [
            "Orichalkum bars yield very poor smithing experience relative to their durability. Mine 16 for a +3 pickaxe, 2 for a hatchet, 2 for the ore box, and another 30 for the Everything Is Oresome achievement. The rest can be used for Unensouled bars or Masterwork armor .",
            "Mine Orichalcite ore at the Mining Guild , dumping ore at a furnace in the Artisan's Worshop . Switch to Drakolith occasionally if you haven't achieved 70 Smithing. Mine Seren stones in the Trahaearn Clan's district of Prifddinas."
        ]
    },
    {
        "title": "Levels 97+: Alaea crablets",
        "content": [
            "Alaea crablets and corrupted ore."
        ]
    }
]