[
    {
        "title": "Training methods",
        "content": [
            "- Levels 1-5: Fletch arrow shafts from normal logs. Level 1-25 alternative: Make headless arrows . Buying arrow shafts and feathers is however very expensive, costing ~300,000 gp to reach level 25, hence early game ironmen would be advised to initially follow the below progression instead.\n- Level 1-25 alternative: Make headless arrows . Buying arrow shafts and feathers is however very expensive, costing ~300,000 gp to reach level 25, hence early game ironmen would be advised to initially follow the below progression instead.\n- Level 5-10: Fletch shortbow (u) .\n- Level 10-20: Fletch shieldbow (u) .\n- Level 20-25: Fletch Oak shortbow (u) .\n- Level 25-35: Fletch Oak shieldbow (u) .\n- Level 35-40: Fletch Willow shortbow (u) .\n- Level 40-50: Fletch Willow shieldbow (u) . Free to play players should continue making the highest tier of bow available to them until level 99.\n- Free to play players should continue making the highest tier of bow available to them until level 99.\n- Level 50-52: Fletch Maple shortbow (u) by cutting maple trees at Daemonheim Peninsula resource dungeon . Managing Miscellania can provide large quantities of maple logs.\n- 52+: Broad arrows are the most time efficient method. 9000 arrowheads can be purchased a day for a total of 135,000 xp and 450,000gp. This translates to ~860,718 arrows/43,035,903gp to achieve level 99. Buying the maximum amount of arrowheads each day, this would take a minimum of 96 days.\n- Alternatives: Given that maple logs are available in very large quantities, it is reasonable (although not efficient) to simply craft maple shieldbow (u ) until zygomite carestyling is unlocked. Consider fletching any yew and magic logs  obtained through PVM into the highest tier of bow available. Consider banking all unstrung bows. Bowstrings can be acquired quickly and in large numbers from Temple Trekking once unlocked. This roughly doubles xp gained per log. 75+: Dream of Iaia is good xp, however this is likely better used to train herblore/hunter/construction or crafting 82+: Zygomite Carestyling is a relatively AFK and free method, giving ~200k+ xp per hour. 90+:  If intending to make ascension crossbows , the player will obtain a large surplus of ascension shards whilst grinding for the keystones. If attempting to obtain two crossbows, assuming average luck and farming capsarii for keystones, the player will receive ~150,000 ascension shards equalling 3,000,000 xp in the process.\n- Given that maple logs are available in very large quantities, it is reasonable (although not efficient) to simply craft maple shieldbow (u ) until zygomite carestyling is unlocked.\n- Consider fletching any yew and magic logs  obtained through PVM into the highest tier of bow available.\n- Consider banking all unstrung bows. Bowstrings can be acquired quickly and in large numbers from Temple Trekking once unlocked. This roughly doubles xp gained per log.\n- 75+: Dream of Iaia is good xp, however this is likely better used to train herblore/hunter/construction or crafting\n- 82+: Zygomite Carestyling is a relatively AFK and free method, giving ~200k+ xp per hour.\n- 90+:  If intending to make ascension crossbows , the player will obtain a large surplus of ascension shards whilst grinding for the keystones. If attempting to obtain two crossbows, assuming average luck and farming capsarii for keystones, the player will receive ~150,000 ascension shards equalling 3,000,000 xp in the process."
        ]
    }
]