[
    {
        "title": "Overview",
        "content": [
            "Fletching is one of the most self-sufficient skills for ironmen. Logs come from Woodcutting, bowstrings from spinning flax or Temple Trekking, and dart/arrow tips from Smithing or Slayer rewards. The skill progresses naturally alongside Woodcutting.",
            "The main bottleneck at mid-levels is bowstrings — spinning flax yourself is slow, but Temple Trekking provides a reliable bulk source once unlocked. At higher levels, broad arrows from the Slayer reward shop become the fastest and most cost-effective method."
        ]
    },
    {
        "title": "Levels 1–50: Bows from Woodcutting",
        "content": [
            "Cut logs and fletch them into unstrung bows, then string them. This gives double XP per log and keeps supplies fully self-sufficient.",
            "- Levels 1–10: Shortbow (u) then Shortbow.",
            "- Levels 10–20: Shieldbow (u) then Shieldbow.",
            "- Levels 20–25: Oak shortbow (u) then Oak shortbow.",
            "- Levels 25–35: Oak shieldbow (u) then Oak shieldbow.",
            "- Levels 35–40: Willow shortbow (u) then Willow shortbow.",
            "- Levels 40–50: Willow shieldbow (u) then Willow shieldbow.",
            "Bowstring source: spin flax at a spinning wheel (Lumbridge, Seers' Village). Flax grows on the ground near Seers' Village or can be farmed at level 1. Unlock Temple Trekking as soon as possible — completing routes rewards large stacks of bowstrings far faster than spinning by hand."
        ]
    },
    {
        "title": "Levels 50–52: Maple Bows",
        "content": [
            "- Levels 50–52: Maple shortbow (u) then Maple shortbow.",
            "Maple logs are available at the Daemonheim Peninsula resource dungeon. Managing Miscellania set to Maples provides a large passive daily supply of maple logs throughout this and later levels.",
            "By now Temple Trekking should cover bowstring supply. If not, continue spinning flax in bulk."
        ]
    },
    {
        "title": "Levels 52–99: Broad Arrows (Recommended)",
        "content": [
            "Broad arrows are the fastest XP method for ironmen from level 52 and are fully obtainable without the Grand Exchange.",
            "- Buy broad arrowheads from any Slayer master's reward shop (up to 9,000 per day for coins, or spend Slayer points).",
            "- Combine with arrow shafts (cut from any logs) and feathers (dropped by chickens, birds, and seagulls).",
            "- Each action produces 15 broad arrows for 225 XP — very fast click rate.",
            "At 9,000 arrowheads per day, this yields 135,000 XP/day and is the primary daily driver toward level 99.",
            "Feather tip: kill chickens at a farm (Lumbridge, Falador), or buy feathers from fishing shops in Catherby and Port Sarim for a small coin cost."
        ]
    },
    {
        "title": "Alternative and Endgame Methods",
        "content": [
            "- Zygomite carestyling (level 82+, Player-Owned Farm): very AFK, giving 200,000+ XP/hour once unlocked via POF.",
            "- Bakriminel bolts (levels 89–99): fletched from blisterwood logs cut in Darkmeyer (requires Branches of Darkmeyer). Good XP and useful combat ammunition.",
            "- Ascension bolts (level 90+): if farming Ascension Crossbows, each full grind yields roughly 150,000 Ascension shards — 3,000,000 Fletching XP as a side effect.",
            "- Dream of Iaia (level 75+): decent XP but the materials are often better spent on Herblore, Hunter, or Construction.",
            "- Elder shieldbow (u) / Elder shieldbow (levels 90/95): high XP per bow if elder logs are available from Woodcutting."
        ]
    }
]
