[
    {
        "title": "Overview",
        "content": [
            "Prayer training as an ironman centres on gathering bones and ashes from monsters you kill rather than buying from the Grand Exchange. The altar multipliers are identical — a Gilded Altar or Chaos Altar still gives 3.5x XP per bone.",
            "Slayer and bossing are the most consistent sources of quality bones. Save every bone you collect and batch-offer them at an altar once you have a large stack. Building a Gilded Altar in your POH (level 75 Construction) is the best long-term investment for your gathered bones.",
            "Do not waste early bones at low multipliers — it is worth waiting until you have altar access even if it means a slower start."
        ]
    },
    {
        "title": "Levels 1–50: Common Bones",
        "content": [
            "Regular Bones (4.5 XP) and Big Bones (15 XP) drop from a huge range of common monsters. Completing The Restless Ghost and Holy Grail quests grants Prayer XP and helps reach early milestones without spending bones.",
            "Baby Dragon Bones (30 XP) drop from baby dragons in the Brimhaven Dungeon and Entrana Dungeon. Dragon Bones (72 XP) are a guaranteed drop from every adult dragon — prioritise killing these when possible.",
            "Save bones in a bank and offer them all at once once you have altar access. Use the Chaos Altar if you do not yet have a POH Gilded Altar and are comfortable with light Wilderness exposure."
        ]
    },
    {
        "title": "Levels 50–80: Dagannoth Kings and Wyverns",
        "content": [
            "Dagannoth Bones (125 XP) drop from Dagannoth Kings in Waterbirth Island dungeon — one of the best ironman bone sources before Dragonkin content. The Kings also drop valuable gear, making them worth visiting for multiple reasons.",
            "Wyvern Bones (50 XP) drop from Wyverns and Skeletal Wyverns. While not the best XP, they are commonly collected during Slayer and worth banking.",
            "Powder of Burials from the Gorajo Resource Dungeon (level 48 Dungeoneering) gives 3.5x XP anywhere — very useful before you have a POH altar."
        ]
    },
    {
        "title": "Levels 80–99: Frost Dragons and High-Tier Drops",
        "content": [
            "Frost Dragon Bones (180 XP) are a guaranteed drop from Frost Dragons in the Asgarnian Ice Dungeon resource dungeon (level 85 Dungeoneering required). This is the premier ironman Prayer training method at high levels.",
            "Airut Bones (132.5 XP) drop from Airuts during Slayer tasks and are commonly collected passively. Ourg Bones (140 XP) are rarer but obtainable from Dungeoneering and certain Slayer monsters — save all of these.",
            "Dragonkin Bones (160 XP) are dropped by various Dragonkin creatures. At this stage offer all bones at your Gilded Altar with lit burners for maximum efficiency.",
            "After completing Plague's End, use any Cleansing Crystals accumulated from the Hefin agility course — especially during the Voice of Seren hour for the 20% XP bonus."
        ]
    }
]
