[
    {
        "title": "Levels 30-50: Clockwork suits",
        "content": [
            "With at least level 30 Agility, players can begin training by releasing and catching clockwork suits . Partial completion of the Cold War quest, up until the point where the player learns how to make a clockwork suit, is required for this method of training. It is recommended that the player makes at least 4 clockwork suits for this training method. Players must be using Evolution of Combat combat mode so that they can use the action bar .",
            "Use the \"wind\" option on at least one clockwork suit and add both a wound and unwound clockwork suit to the action bar. Use the associated keybinds to wind and release clockwork suits while at the same time clicking on the released clockwork suits to pick them up. Agility experience is gained each time that the player attempts to pick up a clockwork suit, regardless of whether they are successful or unsuccessful in picking up the suit.",
            "For ease of picking up the suits, players are strongly advised to use this training method while standing in a confined area. A good location for this training method can be found at the top of the eastern tower of White Knights' Castle in Falador . If the player positions the camera at the right angle, all three squares that the suit can occupy will fall under the mouse. This means only the two key binds for winding/releasing and a mouse click are required as inputs, and almost no attention to the screen is required. Around 40,000 experience an hour can be gained from this training method."
        ]
    },
    {
        "title": "Alternative: Levels 30-50: Anachronia Agility Course (beginner)",
        "content": [
            "After completing visiting Anachronia and completing the base camp tutorial , players with 30 Agility can traverse the beginner sections of the Anachronia Agility Course . The northern section has much shorter lap times and will grant around 28,000 experience per hour.",
            "On the Anachronia course, players will take damage if they fail obstacles, but will still progress and gain experience. Course section completion in either direction awards the completion bonus; so it is recommended to simply repeat going back and forth through the section. The entire island is sometimes subject to a powerful roar which will give players an extra 25% experience and other rewards. Players can also build the Anachronia base camp spa for a persistent 5, 7, or 10% bonus to agility experience from the course. Each obstacle players cross has a chance of dropping 1-4 codex pages , and materials for the base camp, with course completion awarding 10 pages. Codex page drop rates are increased when the powerful roar is active.",
            "Movement abilities such as Surge , Escape , Dive , Bladed Dive and Barge are beneficial to travel between the course's obstacles more quickly. The Mobile perk and Shadow's Grace relic power each reduce the cooldown of these abilities by 50%. Additionally, a Double Surge codex can be consumed to permanently grant a second charge to Surge , allowing for two consecutive use of the ability."
        ]
    },
    {
        "title": "Levels 52-80: Wilderness Agility Course",
        "content": [
            "At level 52 Agility, players should start training at the Wilderness Agility Course . Failure is common at these levels, so it is recommended to bring food , or another method to regain life points. Damage from failure is based on a percentage of remaining health, thus keeping your health around 25% is ideal.",
            "The demonic skull can be equipped to give a scaling bonus to all Agility experience gained while doing the course. Possession of a demonic skull in the Wilderness will result in the player being opted into dangerous PvP ; regardless of their usual setting for PvP. Players gain at least double experience for doing the course with the skull equipped from level 67 Agility onward and 296% experience at level 99. Between 63,000 and 118,000 experience an hour can be gained while doing laps of the Wilderness Agility Course at these levels. 5% additional experience can be gained on completing a lap if the player has the Wilderness sword 2 , obtained from completing the medium Wilderness achievements , or better equipped or in the backpack. The Wilderness sword , demonic skull's bonuses, and Double XP effect do stack."
        ]
    },
    {
        "title": "Alternative Levels 65-77: Het's Oasis Agility Course",
        "content": [
            "If you do not want to train at the Wilderness course, continue training at the novice Anachronia course until level 65 Agility. At level 65 switch to the Het's Oasis Agility Course . Training on this course gives around 70,000 Agility experience an hour.",
            "Completing the course gives a total of 2,045 experience and takes approximately 1 minute and 45 seconds to complete. Players can fail obstacles and each obstacle they fail reduces the amount of experience they get from completing the final obstacle (jumping down the large rock - 1,060 XP) by 1% (10.6 XP) per fail."
        ]
    },
    {
        "title": "Levels 80/85-99+: Island-wide Anachronia Agility Course",
        "content": [
            "The complete Anachronia Agility Course requires at least 85 Agility to complete the entire course; however, level 85 is only required for a short section of the course. Players with 80 Agility may pass this section using 1-2 bites of summer pie , which boosts their Agility level to 85 and is relatively cheap and easy to acquire. The agility boost from a God banner also boosts from 80 to 85 agility, and lasts thirty minutes, though it can only be used once per day. Players with 79 Agility (and 77 Herblore ) may consider using stamina potions at a significantly higher cost. The costs of these items are easily offset by the profit from codex pages, so it is recommended to start training at Anachronia as early as possible, both for faster levelling and for monetary reasons.",
            "Each obstacle provides 20 Agility experience. Finishing a section (in any direction) gives additional experience. Completing the entire circuit of seven sections around the island will yield an additional 15,500 experience for a total of 20,040 experience for an entire lap. It is recommended to use Surge and Dive , as well as the Mobile perk, to move around the course quicker. A player using only Surge and paying moderate attention may expect an average lap time of around 8:30.",
            "With the Nimble outfit and the tier 3 Anachronia base camp upgrade, doing 6:30 laps, players can expect up to 220,000 experience per hour doing the full course.",
            "Players who have Brawling gloves (Agility) can choose to equip the gloves right before the last obstacle of the lap, which will boost the lap completion bonus by 50% (75% with the tier 4 Infernal Puzzle Box bonus) while only using charges on that obstacle. Due to the section and lap completion bonuses, 3 charges are used at once. Each pair of gloves will last for around 137 laps when used in this way."
        ]
    },
    {
        "title": "Empty Throne Room (65+)",
        "content": [
            "At level 65, players can gain a cap of 800,000 experience on the Manual Auto-cycles in The Empty Throne Room , located in the Varrock Dig Site . This is a fully AFK activity, but rewards a very low amount of experience per hour compared to completing laps of the Het's Oasis Agility Course at level 65. If players wish to be efficient, they can move between the empowered auto-cycles (which have a purple glow under them) to gain increased experience; the cycle that is empowered changes often, usually within a minute. The amount of experience that has been gained using cycles can be checked by speaking to Celia Diggory outside of the throne room."
        ]
    },
    {
        "title": "Serenity posts (75+)",
        "content": [
            "Serenity posts are an Agility training activity which can be completed to gain a maximum of 20,000 Agility experience once per day. Level 75 Agility is required to participate in the activity, as well as completion of the Plague's End quest. To begin the activity use the \"balance on\" option on any of the 6 serenity posts in the Hefin district training area, and choose a pose in the minigame interface.",
            "Experience is gained once per second while balanced on a serenity post. Maximum experience is gained when imitating Lady Hefin 's pose. Doing the same pose as her grants between 30-58 Agility experience each second, depending on the player's Agility level, while doing a different pose to Lady Hefin grants 10% of this amount of experience. Only base experience gains count towards the daily limit. Upon reaching the limit the player's character will automatically leave the serenity post, and they will be unable to stand on the post again until the next day. A player with level 99 Agility can obtain the 20,000 experience limit in around 10 minutes, giving an experience rate equivalent to 120,000 experience an hour."
        ]
    }
]