[
    {
        "title": "Overview",
        "content": [
            "Summoning training as an ironman is identical in method to P2P — you create pouches at Obelisks using charms, spirit shards, and tertiary ingredients. The difference is that you must obtain all ingredients through gameplay rather than the Grand Exchange.",
            "Spirit shards are purchased from Pikkupstix in Taverley (not the GE), so shard supply is unlimited. Tertiary ingredients are mostly dropped by common monsters or obtained through skilling. Charms are gathered through combat and Slayer.",
            "The Bogrog exchange mechanic works the same — exchange finished pouches for 70% shards back. This keeps your shard costs manageable."
        ]
    },
    {
        "title": "Building a Charm Bank",
        "content": [
            "Slayer is the most efficient way to accumulate charms as an ironman. Slayer tasks provide consistent charm drops across a wide variety of monsters, and the combat XP is a bonus.",
            "Gold charms are plentiful from almost any combat. Focus on farming Crimson charms through Slayer tasks on monsters like Waterfiends, Glacors, and Abyssal demons. Blue charms are very rare — do not expect many before late-game bossing.",
            "Consider doing a combat/Slayer-heavy phase first to build up a large charm bank before spending a session creating pouches in bulk."
        ]
    },
    {
        "title": "Tertiary Ingredients",
        "content": [
            "Most low-level tertiary ingredients are dropped by common monsters or obtained through Farming and Herblore. Notable examples: Raw bird meat (Spirit Terrorbird) from birds, Raw fish (Bunyip) from fishing, Pouch of gold (Macaw) from thieving.",
            "Higher-level ingredients such as Crushed dragonstone (Spirit Dragon) and Blue charm items are obtainable from Slayer and bosses.",
            "Check the RS3 wiki for exact tertiary ingredient sources for any pouch you plan to make — most are obtainable within normal ironman gameplay."
        ]
    },
    {
        "title": "Training Progression",
        "content": [
            "Follow the same pouch progression as P2P: Gold charms for levels 1-40, then Crimson as your primary charm from level 40 onwards. Make the highest-level pouch available with each charm type.",
            "Prioritise reaching level 67 (Bunyip) for passive healing in combat, and level 80 (Pack Yak) for the 30-slot familiar — both are transformative for ironman gameplay.",
            "Do not discard pouches you will never use — exchange them with Bogrog for shards. The only pouches worth keeping are those you will actively use for combat or skilling."
        ]
    }
]
