[
    {
        "title": "Overview",
        "content": [
            "Herblore is a members-only skill focused on making potions from herbs and secondary ingredients. Potions provide powerful combat and skilling boosts that are used throughout the game. The skill cap is level 120.",
            "Herblore is expensive to train quickly. The fastest methods involve bulk-buying herbs and secondaries from the Grand Exchange and making potions back-to-back. If cost is a concern, making in-demand potions like Prayer potions or Super restores can offset or eliminate costs.",
            "The most important boost for training: set up near a Portable well on World 84 (Fort Forinthry, Lumbridge Bank, or Grand Exchange). It grants +10% XP per potion and a chance to save secondaries. Combined with a Botanist's mask (+5% chance at a bonus potion) and a Factory outfit, you can gain significant extra potions for free."
        ]
    },
    {
        "title": "Levels 1–38: Early Potions",
        "content": [
            "At low levels the XP per potion is small. Use quest experience rewards to skip ahead where possible — Druidic Ritual grants 250 XP and is required for Herblore, while many quests hand out several thousand Herblore XP.",
            "- Levels 3–22: Attack potions (Guam + Eye of Newt, 25 XP each). Cheap and easy to obtain early on.",
            "- Levels 5–22: Antipoisons (Marrentill + Unicorn Horn Dust, 37.5 XP). Useful to make for Slayer.",
            "- Levels 12–22: Strength potions (Tarromin + Limpwurt Root, 50 XP). Commonly profitable.",
            "- Levels 22–38: Restore potions (Harralander + Red Spider Eggs, 62.5 XP). Reasonable mid-tier option.",
            "Tip: Check the Herblore calculator on this site to compare potion costs at your current level."
        ]
    },
    {
        "title": "Levels 19+: Making Tar (AFK Method)",
        "content": [
            "Requires completion of Lunar Diplomacy. Combine swamp tar with a herb to create tar usable in a Slayer lamp or Swamp titan pouch. This method is very AFK and gives solid XP per hour.",
            "- Guam tar: level 19, 47.5 XP — cheap and widely available.",
            "- Marrentill tar: level 31, 42.5 XP.",
            "- Tarromin tar: level 39, 55 XP.",
            "- Harralander tar: level 44, 72.5 XP.",
            "Tar is great for training while watching video or multitasking. Its main downside is the need to stockpile large amounts of swamp tar."
        ]
    },
    {
        "title": "Levels 38–70: Mid-Level Potions",
        "content": [
            "This range is where training becomes more expensive but faster. Always use a Portable well for the XP bonus.",
            "- Level 38: Prayer potions (Ranarr + Snape Grass, 87.5 XP). Frequently profitable; one of the most-used potions in the game.",
            "- Level 45: Super attack (Irit + Eye of Newt, 100 XP). Good daily volume.",
            "- Level 52: Super antipoison (Irit + Unicorn Horn Dust, 106.3 XP).",
            "- Level 55: Super strength (Kwuarm + Limpwurt Root, 125 XP).",
            "- Level 63: Super restore (Snapdragon + Red Spider Eggs, 142.5 XP). One of the best profit options.",
            "- Level 66: Super defence (Cadantine + White Berries, 150 XP).",
            "For fast XP without concern for profit, focus on whichever potion gives the highest XP per hour that you can afford. Super restores or Prayer potions are often close to break-even."
        ]
    },
    {
        "title": "Levels 70–96: High-Level Potions",
        "content": [
            "At this range you unlock many of the best potions in the game. Costs increase but so does XP per potion.",
            "- Level 69: Antifire potion (Lantadyme + Dragon Scale Dust, 157.5 XP).",
            "- Level 76: Magic potion (Lantadyme + Potato Cactus, 172.5 XP).",
            "- Level 81: Saradomin brew (Toadflax + Crushed Bird's Nest, 180 XP).",
            "- Level 88: Extreme attack (Avantoe + Super attack, 220 XP).",
            "- Level 89: Extreme strength (Dwarf Weed + Super strength, 230 XP).",
            "- Level 90: Extreme defence (Lantadyme + Super defence, 210 XP).",
            "- Level 91: Extreme magic (Ground Mud Rune + Magic potion, 240 XP).",
            "- Level 92: Extreme ranging (Grenwall Spikes + Super ranging, 250 XP).",
            "Making Extremes is expensive but the fastest raw XP method in this bracket."
        ]
    },
    {
        "title": "Levels 96–120: Overloads and Beyond",
        "content": [
            "Overloads combine five Extreme potions into one powerful flask, consuming them in the process. This is where Herblore XP per action peaks.",
            "- Level 96: Overload (all five Extreme potions, 1,000 XP). Very expensive but enormous XP per action.",
            "- Level 97: Supreme overload salve and other combination flasks — up to 1,625 XP per flask.",
            "Overload production requires either purchasing the extremes or mass-producing them yourself first. The cost is significant but the XP is unmatched.",
            "Alternative: Portable wells and pulse cores remain effective through 120. Players who cannot afford overloads can continue with high-tier potions (Saradomin brews, Extremes) for still-respectable rates."
        ]
    },
    {
        "title": "Boosts and Key Items",
        "content": [
            "These items significantly improve Herblore XP rates or reduce costs. Stack as many as you can.",
            "- Portable well: +10% XP per potion, 5% chance to save secondary. Place on W84 at Fort Forinthry for free access.",
            "- Botanist's mask (Botanist's outfit head): +5% chance for an extra potion.",
            "- Modified botanist's mask: same as above but holds charges for an aura effect.",
            "- Factory outfit (3 pieces): 12.5% chance to make a 4-dose instead of 3-dose potion.",
            "- Botanist's amulet: stacks with the mask for more bonus potions.",
            "- Brooch of the Gods: doubles the Portable well bonus.",
            "- Scroll of cleansing: 10% chance to save a secondary ingredient.",
            "- Herblore cape perk: ability to clean a herb without stopping animation.",
            "Herblore urns: passively gain bonus XP while making potions if you have the Crafting level to make them."
        ]
    }
]
