[
    {
        "title": "Overview",
        "content": [
            "Crafting is largely a buyable skill for P2P players. The fastest training methods involve purchasing materials from the Grand Exchange and processing them in bulk. Portable crafters (from Treasure Hunter) grant a 10% XP bonus and are highly recommended.",
            "The skill has a wide range of training methods — dragonhide bodies are the fastest and most commonly used method from level 63 onwards."
        ]
    },
    {
        "title": "Levels 1-20: Leather Items",
        "content": [
            "Use soft leather to craft basic leather items for fast early XP.",
            "- Levels 1-5: Leather gloves (13.8 XP each)",
            "- Levels 5-14: Leather boots (16.3 XP each)",
            "- Levels 14-20: Leather bodies (25 XP each)",
            "Soft leather is made by tanning cowhides at a tanner for 1 coin per hide, or purchased directly from the Grand Exchange."
        ]
    },
    {
        "title": "Levels 20-54: Battlestaves",
        "content": [
            "Attaching elemental orbs to battlestaves is a cheap and steady mid-level training method.",
            "- Attach unpowered orbs or elemental orbs to battlestaves for around 100 XP each",
            "- Battlestaves can be purchased from the Grand Exchange or Zaff in Varrock (daily stock)",
            "- XP rate: approximately 50,000–60,000 XP/hour",
            "Some elemental battlestaves (fire, water, earth, air) may offer a slight profit depending on market prices."
        ]
    },
    {
        "title": "Levels 40-63: Cutting Gems",
        "content": [
            "Cutting uncut gems on a Portable crafter is fast and can be profitable depending on current prices.",
            "- Levels 40-55: Rubies (85 XP each) — commonly used for good XP at lower cost",
            "- Levels 55-63: Diamonds (107.5 XP each) — highest gem XP, worth the extra cost",
            "Always use a Portable crafter for the 10% XP bonus. Gems are widely available on the Grand Exchange."
        ]
    },
    {
        "title": "Levels 63-99/120: Dragonhide Bodies",
        "content": [
            "Crafting dragonhide bodies is the fastest Crafting XP available from level 63 and remains the top method all the way to 99/120.",
            "- Levels 63-71: Green dragonhide bodies (186 XP each)",
            "- Levels 71-77: Blue dragonhide bodies (210 XP each)",
            "- Levels 77-84: Red dragonhide bodies (234 XP each)",
            "- Levels 84-99/120: Black dragonhide bodies (258 XP each) — best standard Crafting XP rate",
            "Buy tanned dragonhides directly from the GE to save time. Use Portable crafters for 10% bonus XP. With portables, rates can exceed 350,000–400,000 XP/hour."
        ]
    },
    {
        "title": "Levels 75-99: Harps at Prifddinas (AFK Alternative)",
        "content": [
            "Playing harps in the Ithell Clan district of Prifddinas is a very AFK-friendly method, albeit slower than dragonhide bodies.",
            "Requires completion of Plague's End. XP rate: approximately 60,000–75,000 XP/hour.",
            "Harps also generate crystal flakes used to recharge crystal equipment, providing a useful Ironman-friendly side benefit."
        ]
    },
    {
        "title": "Boosts and Tips",
        "content": [
            "- Portable crafters: 10% bonus XP on all Crafting actions — the most important boost",
            "- Modified master crafter's outfit: Up to 6% bonus XP from the full set",
            "- Pulse cores: 10% bonus XP for a limited time — best used during dragonhide body crafting",
            "- Double XP events: Significantly reduce the number of hides needed; stock up before events",
            "- The Crafters' Guild provides a useful bank chest near a range for quick leather operations"
        ]
    }
]
